
// ==========================================
// 1. البيانات
// ==========================================
        var lectures = [
            { title: "المحاضرة الأولى",  desc: "تعريف واهمية ووظائف القانون.", pdf: "lectures/lec1.pdf",pdf2:"qestions/Lecture_questions/lec1_questions.pdf",
             interactive: true, 
            questions: [
                  {
                "text": "ما هو تعريف القانون في اللغة؟",
                "options": [
                    "مجموعة قواعد تنظم سلوك الأفراد",
                    "كل قاعدة ثابتة ومطردة",
                    "مجموعة قواعد إنسانية في مجتمع معين",
                    "يبدأ بالتصادف وينتهي بالثبات"
                ],
                "answer": "كل قاعدة ثابتة ومطردة"
            },
            {
                "text": "ما هو المعنى الضيق للقانون؟",
                "options": [
                    "مجموعة القواعد التي تنظم سلوك الأفراد في مجتمع معين أو زمن معين أو بلد معين",
                    "مجموعة القواعد القانونية التي تنظم سلوك الأفراد داخل المجتمع",
                    "قواعد تنظم العلاقات الأسرية فقط",
                    "قواعد تنظم الاقتصاد فقط"
                ],
                "answer": "مجموعة القواعد التي تنظم سلوك الأفراد في مجتمع معين أو زمن معين أو بلد معين"
            },
            {
                "text": "ما هي أهمية القانون في المجتمع؟",
                "options": [
                    "تعسف الأفراد",
                    "استغلال الأفراد للمجتمع",
                    "تنظيم العلاقات بين الأفراد في المجتمع",
                    "تمهيد الاعتداء على الأفراد"
                ],
                "answer": "تنظيم العلاقات بين الأفراد في المجتمع"
            },
            {
                "text": "ما هي الضرورة النفسية لوجود القانون؟",
                "options": [
                    "يساعد الأفراد على العيش بمفردهم",
                    "تدمير كيان المجتمعات",
                    "تجنب الآثار النفسية والصحية الناتجة عن العزلة",
                    "تمهيد التمكن من النزاعات"
                ],
                "answer": "تجنب الآثار النفسية والصحية الناتجة عن العزلة"
            },
            {
                "text": "سبب القانون في تحقيق التوازن هو:",
                "options": [
                    "الذل والاستسلام",
                    "الصالح العام للأفراد",
                    "الاقتصاد والتجارة",
                    "العادات والتقاليد"
                ],
                "answer": "الصالح العام للأفراد"
            },
            {
                "text": "ما هي الوظيفة الأولى للقانون؟",
                "options": [
                    "تدمير الأمن في المجتمع",
                    "تنظيم النشاطات الاقتصادية فقط",
                    "دعم الفوضى والاضطراب",
                    "تحقيق الأمن في المجتمع"
                ],
                "answer": "تحقيق الأمن في المجتمع"
            },
            {
                "text": "لو بدا المجتمع أن يفرض القانون جساءاً فلماذا؟",
                "options": [
                    "نعم لأنه تراوي ودمى قوانين",
                    "نسيانة بعدة أخطاء",
                    "نقص الأفراد دراية تامة",
                    "الإلغاء المطلق لحرية الفرد"
                ],
                "answer": "نعم لأنه تراوي ودمى قوانين"
            },
            {
                "text": "هدف تحقيق الأمن في المجتمع هو:",
                "options": [
                    "تمهيد التذخم في حياة الأفراد",
                    "حماية حقوق وحريات الأفراد",
                    "دعم الاقتصاد فقط",
                    "إلغاء جميع الحقوق والحريات"
                ],
                "answer": "حماية حقوق وحريات الأفراد"
            },
            {
                "text": "تحقيق الاستقرار في المجتمع يتم من خلال:",
                "options": [
                    "فرض حظر عشوائي",
                    "تربية الأفراد تصرفوا بحرية دون قيود",
                    "تطبيق القواعد التي تحقق التوازن",
                    "السماح بذكر الاستبداد"
                ],
                "answer": "تطبيق القواعد التي تحقق التوازن"
            },
            {
                "text": "مظهر تحقيق الاستقرار الاقتصادي في المجتمع:",
                "options": [
                    "فرض الضرائب فقط",
                    "تذبذب المبادئ الاقتصادية للدولة",
                    "إغلاق الشركات",
                    "ترسيخ المبادئ الاقتصادية للدولة وتنظيم النشاط الاقتصادي"
                ],
                "answer": "ترسيخ المبادئ الاقتصادية للدولة وتنظيم النشاط الاقتصادي"
            },
            {
                "text": "ما الفرق بين العدل والعدالة وفقاً لبعض الآراء؟",
                "options": [
                    "لا يوجد فرق بينهما",
                    "العدل أشمل من العدالة",
                    "العدالة أكثر شمولاً من العدل",
                    "العدل يتعامل مع الأفراد فقط بينما العدالة تتعامل مع المجتمع"
                ],
                "answer": "العدل أشمل من العدالة"
            },
            {
                "text": "ما هو الهدف الأساسي الذي تسعى لتحقيقه العدالة؟",
                "options": [
                    "فرض عقوبات موحدة على الجميع دون مراعاة الظروف",
                    "مراعاة دوافع الجريمة وظروف المجرم",
                    "معاقبة الأبرياء فقط",
                    "معاقبة الجميع بنفس القدر"
                ],
                "answer": "مراعاة دوافع الجريمة وظروف المجرم"
            },
            {
                "text": "ما هو العدل التوزيعي؟",
                "options": [
                    "توزيع الواجبات والخدمات العامة على الأفراد",
                    "توزيع الثروات بين الجميع بالتساوي",
                    "معاملة الأفراد دون مراعاة الظروف الخاصة",
                    "إعطاء الأولوية للأغنياء في الذمم"
                ],
                "answer": "توزيع الواجبات والخدمات العامة على الأفراد"
            },
            {
                "text": "لو بدا القاضي أن يميز العدل لمجتمع علم الوصول فلماذا؟",
                "options": [
                    "لأن الجميع في نفس الظروف",
                    "لأن التفاوت بين الأفراد يتطلب مساواة نسبية",
                    "لأن العدل يتطلب إزالة جميع الفروق الاجتماعية",
                    "لأن المساواة المطلقة تكون دون استثناءات"
                ],
                "answer": "لأن التفاوت بين الأفراد يتطلب مساواة نسبية"
            },
            {

                "text": "من امثلة العدل القانوني",
                "options": [
                    "فرض نفس الضرائب على الجميع دون مراعاة الدخل",
                    "منح الجميع  نفس الحقوق دون تعميز",
                    "معاملة القضايا الجنائية والاقتصادية بنفس الطر يقة",
                    "عدم فرض أي عقوبات على السخالفين للقانون"
                ],
                "answer": "منح الجميع  نفس الحقوق دون تعميز"

            },
            {
                "text": "القانون والمجتمع هما:",
                "options": [
                    "يفترضان التفاصيل التامة",
                    "يرتبطان ولا يمكن أحدهما الاستغناء عن الآخر",
                    "يمكن لأحدهما الوجود بدون الآخر",
                    "يمكن للمجتمع الوجود بدون قانون"
                ],
                "answer": "يرتبطان ولا يمكن أحدهما الاستغناء عن الآخر"
            },
            {
                "text": "ماذا يحدث إذا غاب القانون عن المجتمع؟",
                "options": [
                    "يسود النظام والاستقرار",
                    "تنتشر الفوضى والنزاعات بين الأفراد",
                    "تتقدم العلاقات الاجتماعية",
                    "تسداد الاحتياجات الاقتصادية"
                ],
                "answer": "تنتشر الفوضى والنزاعات بين الأفراد"
            },
            {
                "text": "ما هي وظيفة القانون في المجتمع الديمقراطي؟",
                "options": [
                    "دعم ذكريات التاريخ",
                    "تدمير التوازن بين سلطات الدولة وتحقيق ديمقراطية الأفراد",
                    "يحقن سلطات الحاكم فقط",
                    "إلغاء دور الأفراد في المجتمع"
                ],
                "answer": "تدمير التوازن بين سلطات الدولة وتحقيق ديمقراطية الأفراد"
            },
            {
                "text": "أحد أهداف القانون في المجتمع الديمقراطي هو:",
                "options": [
                    "زيادة الفجوة بين الذكور والإناث",
                    "تحقيق ديمقراطية الأفراد وحرياتهم",
                    "تمهيد عقوبات مبالغ فيها",
                    "السماح بانتشار الفساد"
                ],
                "answer": "تحقيق ديمقراطية الأفراد وحرياتهم"
            },
            {
                "text": "كيف يساهم القانون في تحقيق العدالة للجميع؟",
                "options": [
                    "من خلال فرض ضرائف بشكل مشترك",
                    "عبر تنظيم العلاقات بين الأفراد وتحقيق العدالة لهم",
                    "من خلال إخفاء المعلومات عن المواطنين",
                    "بعدم تطبيق القانون على الجميع"
                ],
                "answer": "عبر تنظيم العلاقات بين الأفراد وتحقيق العدالة لهم"
            }

            ] },
            { title: "المحاضرة الثانية", desc: "خصائص القاعدة القانونية.", pdf: "lectures/lec2.pdf",pdf2:"qestions/Lecture_questions/lec2_questions.pdf", 
            questions: [

               {
                "text": "القاعدة القانونية تعتبر قاعدة سلوك لأنها:",
                "options": [
                    "تهدف إلى توجيه سلوك الأفراد في المجتمع",
                    "تهتم فقط بالنوايا والبواعث الداخلية",
                    "تعتمد على الأخلاق فقط دون جزاء قانوني",
                    "لا تهتم بتنظيم المجتمع"
                ],
                "answer": "تهدف إلى توجيه سلوك الأفراد في المجتمع"
            },
            {
                "text": "ما الذي يميز القاعدة القانونية عن القاعدة التقريرية؟",
                "options": [
                    "القاعدة القانونية تقريرية بطبيعتها",
                    "القاعدة القانونية تهدف إلى تقويم سلوك الأفراد",
                    "القاعدة التقريرية تهدف إلى فرض الجزاءات",
                    "القاعدة التقريرية تهتم فقط بالعقوبات"
                ],
                "answer": "القاعدة القانونية تهدف إلى تقويم سلوك الأفراد"
            },
            {
                "text": "القاعدة القانونية لا تعتمد بالنوايا الداخلية لأنها:",
                "options": [
                    "تهتم فقط بالسلوك المادي الظاهر",
                    "تعتمد على النية في توقيع الجزاء",
                    "تعاقب الأفراد بناءً على تفكيرهم فقط",
                    "تتجاهل أفعال الأفراد تماماً"
                ],
                "answer": "تهتم فقط بالسلوك المادي الظاهر"
            },
            {
                "text": "ما المقصود بكون القاعدة القانونية 'قاعدة عامة مجردة'؟",
                "options": [
                    "تطبق على شخص معين باسمه",
                    "تخاطب جميع الأشخاص والوقائع التي تتوافر فيها شروطها",
                    "تخص حالات فردية دون تعميم",
                    "تنطبق فقط على القوانين الاقتصادية"
                ],
                "answer": "تخاطب جميع الأشخاص والوقائع التي تتوافر فيها شروطها"
            },
            {
                "text": "القوانين التي تنظم مهنة معينة مثل المحاماة والطب تعتبر:",
                "options": [
                    "قوانين فردية وليست عامة",
                    "لا تعتبر قواعد قانونية",
                    "تبقى قواعد قانونية عامة ومجردة",
                    "لا يمكن تطبيقها إلا على الجميع"
                ],
                "answer": "تبقى قواعد قانونية عامة ومجردة"
            },
            {
                "text": "لماذا تعتبر القاعدة القانونية قاعدة اجتماعية؟",
                "options": [
                    "لأنها تهدف إلى تنظيم علاقات الأفراد في المجتمع",
                    "لأنها تهتم فقط بالقواعد الدينية",
                    "لأنها لا تؤثر على الحياة اليومية للأفراد",
                    "لأنها تطبق فقط على الأغنياء"
                ],
                "answer": "لأنها تهدف إلى تنظيم علاقات الأفراد في المجتمع"
            },
            {
                "text": "ما النتيجة المترتبة على كون القاعدة القانونية قاعدة اجتماعية؟",
                "options": [
                    "يجب أن تعكس ظروف المجتمع",
                    "لا تتغير أبداً بتغير الزمان",
                    "تطبق فقط على الأغنياء",
                    "لا تتأثر بالأوضاع الاقتصادية للدولة"
                ],
                "answer": "يجب أن تعكس ظروف المجتمع"
            },
            {
                "text": "ما الذي يميز القاعدة القانونية عن القواعد الأخلاقية؟",
                "options": [
                    "القاعدة القانونية إلزامية بجزاء",
                    "القاعدة القانونية تعتمد فقط على الضمير الشخصي",
                    "القاعدة القانونية لا تتغير أبداً",
                    "القواعد الأخلاقية دائماً مصحوبة بعقوبات قانونية"
                ],
                "answer": "القاعدة القانونية إلزامية بجزاء"
            },
            {
                "text": "الجزاء في القاعدة القانونية يجب أن يكون:",
                "options": [
                    "مادياً فقط",
                    "فورياً ومباشراً ومنظماً قانونياً",
                    "معنوياً دون تأثير فعلي",
                    "غير مرتبط بتطبيق القوانين"
                ],
                "answer": "فورياً ومباشراً ومنظماً قانونياً"
            },
            {
                "text": "من أمثلة الجزاء المدني:",
                "options": [
                    "الإعدام",
                    "البطلان والفسخ والتعويض",
                    "السجن المؤبد",
                    "المصادرة فقط"
                ],
                "answer": "البطلان والفسخ والتعويض"
            },
            {
                "text": "ما هو الجزاء الجنائي؟",
                "options": [
                    "عقوبة توقعها الدولة على مخالفة القوانين الجنائية",
                    "جزاء إداري يطبق فقط على الموظفين",
                    "جزاء سياسي مرتبط بالحكومة فقط",
                    "نوع من الجزاءات المدنية"
                ],
                "answer": "عقوبة توقعها الدولة على مخالفة القوانين الجنائية"
            },
            {
                "text": "أي من الجرائم التالية تُعتبر الأخطر؟",
                "options": [
                    "المخالفات",
                    "الجنح",
                    "الجنايات",
                    "جميعها بنفس الخطورة"
                ],
                "answer": "الجنايات"
            },
            {
                "text": "ما المقصود بالجزاء الإداري؟",
                "options": [
                    "الجزاء الذي توقعه الدولة على الموظفين المخالفين",
                    "جزاء يطبق فقط على الشركات التجارية",
                    "جزاء يخص القوانين الدستورية",
                    "جزاء مدني للأفراد فقط"
                ],
                "answer": "الجزاء الذي توقعه الدولة على الموظفين المخالفين"
            },
            {
                "text": "من أمثلة الجزاءات الإدارية:",
                "options": [
                    "الإنذار واللوم والفصل من الوظيفة",
                    "الإعدام",
                    "التعويض المالي فقط",
                    "جميع ما سبق"
                ],
                "answer": "الإنذار واللوم والفصل من الوظيفة"
            },
            {
                "text": "ما هو الجزاء السياسي؟",
                "options": [
                    "الجزاء الذي يترتب على مخالفة قواعد الدستور",
                    "جزاء يطبق على الموظفين الإداريين فقط",
                    "جزاء مدني مرتبط بالمحاكم التجارية",
                    "جزاء جنائي يشمل الغرامات فقط"
                ],
                "answer": "الجزاء الذي يترتب على مخالفة قواعد الدستور"
            },
            {
                "text": "ما الفائدة من وجود جزاءات قانونية؟",
                "options": [
                    "ضمان احترام القوانين",
                    "العقاب فقط دون إصلاح المجتمع",
                    "تعزيز الفوضى القانونية",
                    "منع الأفراد من ممارسة حقوقهم"
                ],
                "answer": "ضمان احترام القوانين"
            },
            {
                "text": "أي من الأوصاف التالية ينطبق على القاعدة القانونية؟",
                "options": [
                    "عامة ومجردة",
                    "غير ملزمة",
                    "لا تؤثر على الأفراد",
                    "تطبق على شخص واحد فقط"
                ],
                "answer": "عامة ومجردة"
            },
            {
                "text": "أي من الجزاءات التالية يعتبر جزاءً جنائياً؟",
                "options": [
                    "الغرامة والسجن",
                    "الإنذار الإداري",
                    "بطلان العقد",
                    "إلغاء الترقية"
                ],
                "answer": "الغرامة والسجن"
            },
            {
                "text": "القاعدة القانونية تكتسب قوتها من:",
                "options": [
                    "التزام الأفراد بها وجوباً",
                    "تطبيقها بشكل اختياري فقط",
                    "كونها تعتمد على العادات فقط",
                    "عدم ارتباطها بالقضاء"
                ],
                "answer": "التزام الأفراد بها وجوباً"
            },
            {
                "text": "القوانين التي تصدر أثناء الكوارث الطبيعية تعتبر:",
                "options": [
                    "قواعد قانونية عامة ومجردة",
                    "غير ملزمة",
                    "ذات تطبيق فردي فقط",
                    "لا تعتبر قوانين فعلية"
                ],
                "answer": "قواعد قانونية عامة ومجردة"
            }            
            ] },
            { title: "المحاضرة الثالثة", desc: "علاقة القواعد القانونية بالقواعد السلوك الاجتماعي الأخرى",pdf: "lectures/lec3.pdf",pdf2:"qestions/Lecture_questions/lec4_questions.pdf", 
            questions: 
            
                [
    {
        "text": "ما هو المصدر الأساسي لقواعد الدين؟",
        "options": [
            "البشر",
            "القوانين الوضعية",
            "الله ورسوله",
            "الأعراف والتقاليد"
        ],
        "answer": "الله ورسوله"
    },
    {
        "text": "أي من العبارات التالية ليست من أوجه التشابه بين قواعد الدين والقانون؟",
        "options": [
            "كليهما يهدي إلى تنظيم المجتمع",
            "كليهما يتسم بالعمومية والتجريد",
            "كليهما قواعد ملزمة بجزاء",
            "كليهما صادر عن سلطة بشرية"
        ],
        "answer": "كليهما صادر عن سلطة بشرية"
    },
    {
        "text": "ما هو الاختلاف الأساسي بين قواعد الدين والقانون من حيث الجزاء؟",
        "options": [
            "الجزاء في القانون فقط مادي، بينما في الدين مادي ومعنوي",
            "الجزاء في الدين يطبق فقط في الحياة الدنيا",
            "القانون لا يتضمن جزاءات على الإطلاق",
            "الدين يعاقب المخالف فقط في الدنيا دون الآخرة"
        ],
        "answer": "الجزاء في القانون فقط مادي، بينما في الدين مادي ومعنوي"
    },
    {
        "text": "أي مما يلي ليس من أوجه الاختلاف بين قواعد الدين والقانون؟",
        "options": [
            "المصدر",
            "الغاية أو الهدف",
            "عمومية القاعدة",
            "مدى الجزاء"
        ],
        "answer": "عمومية القاعدة"
    },
    {
        "text": "لماذا يمكن أن تكون غاية قواعد القانون نفعية؟",
        "options": [
            "لأنها تسعى لتحقيق العدالة المطلقة",
            "لأنها تركز على تنظيم العلاقات بين الأفراد دون اعتبار للأخلاق دائماً",
            "لأنها تعتمد على العقوبات الإلهية",
            "لأنها مستمدة فقط من قواعد الأخلاق"
        ],
        "answer": "لأنها تركز على تنظيم العلاقات بين الأفراد دون اعتبار للأخلاق دائماً"
    },
    {
        "text": "أى من العبارات التالية تصف القواعد الأخلاقية بدقة؟",
        "options": [
            "قواعد ملزمة قانونياً دائماً",
            "قواعد تهدف إلى السمو بالإنسان والمجتمع",
            "قواعد تنظم فقط العلاقات التجارية"
        ],
        "answer": "قواعد تهدف إلى السمو بالإنسان والمجتمع"
    },
    {
        "text": "أي القواعد تهتم بتنظيم العلاقة بين الإنسان وربه؟",
        "options": [
            "القواعد القانونية",
            "قواعد الأخلاق",
            "قواعد الدين",
            "قواعد المجاملات"
        ],
        "answer": "قواعد الدين"
    },
    {
        "text": "أي من هذه القواعد يكون جزاؤها مزدوجًا (دنيوي وأخروي)؟",
        "options": [
            "القواعد القانونية",
            "القواعد الدينية",
            "قواعد الأخلاق",
            "قواعد المجاملات"
        ],
        "answer": "القواعد الدينية"
    },
    {
        "text": "أي من هذه القواعد تعتمد على الجزاء الإلزامي المادي فقط؟",
        "options": [
            "القواعد القانونية",
            "قواعد الدين",
            "قواعد المجاملات",
            "قواعد الأخلاق"
        ],
        "answer": "القواعد القانونية"
    }
]
},
            { title: "المحاضرة الرابعة", desc: "فروع القانون.", pdf: "lectures/lec4.pdf",pdf2:"qestions/Lecture_questions/lec3_questions.pdf", 
            questions: [
                 {
                "text": "أي مما يلي يُعتبر فرعاً من فروع القانون العام؟",
                "options": [
                    "القانون المدني",
                    "القانون التجاري",
                    "القانون الدستوري",
                    "القانون الجنائي الخاص"
                ],
                "answer": "القانون الدستوري"
            },
            {
                "text": "القانون الدولي العام يُنظم العلاقات بين:",
                "options": [
                    "الأشخاص الطبيعيين فقط",
                    "الأشخاص الاعتباريين فقط",
                    "الدول وبعضها البعض",
                    "الشركات التجارية"
                ],
                "answer": "الدول وبعضها البعض"
            },
            {
                "text": "أي من الفروع التالية يُحدد شكل الدولة ونظام الحكم فيها؟",
                "options": [
                    "القانون الإداري",
                    "القانون الدستوري",
                    "القانون الجنائي",
                    "القانون المدني"
                ],
                "answer": "القانون الدستوري"
            },
            {
                "text": "ما هو الفرع الذي يُنظم نشاط السلطة التنفيذية وعلاقة الدولة بموظفيها؟",
                "options": [
                    "القانون الجنائي",
                    "القانون المدني",
                    "القانون الإداري",
                    "القانون الدولي الخاص"
                ],
                "answer": "القانون الإداري"
            },
            {
                "text": "القانون الجنائي يُقسم إلى:",
                "options": [
                    "القانون الجنائي والقانون المدني",
                    "قانون العقوبات وقانون الإجراءات الجنائية",
                    "القانون العام والقانون الخاص",
                    "القانون الدستوري والقانون الإداري"
                ],
                "answer": "قانون العقوبات وقانون الإجراءات الجنائية"
            },
            {
                "text": "أي من الفروع التالية يُنظم العلاقات بين أشخاص القانون الخاص؟",
                "options": [
                    "القانون الإداري",
                    "القانون الدستوري",
                    "القانون المدني",
                    "القانون الجنائي"
                ],
                "answer": "القانون المدني"
            },
            {
                "text": "ما هو القانون الذي يُنظم العلاقات القانونية بين العمال وأرباب الأعمال؟",
                "options": [
                    "القانون التجاري",
                    "قانون العمل",
                    "القانون المدني",
                    "القانون الإداري"
                ],
                "answer": "قانون العمل"
            },
            {
                "text": "أي من الفروع التالية يُعتبر من فروع القانون الخاص؟",
                "options": [
                    "القانون الدولي العام",
                    "القانون الدستوري",
                    "القانون التجاري",
                    "القانون الإداري"
                ],
                "answer": "القانون التجاري"
            },
            {
                "text": "القانون البحري يُنظم:",
                "options": [
                    "تنظيم العلاقات بين الدول",
                    "تنظيم النشاط الزراعي في الدولة",
                    "العلاقات القانونية المتعلقة بالملاحة البحرية",
                    "العلاقات بين العمال وأرباب الأعمال"
                ],
                "answer": "العلاقات القانونية المتعلقة بالملاحة البحرية"
            },
            {
                "text": "أي فرع من فروع القانون يُنظم العلاقات التي تكون الدولة طرفاً فيها باعتبارها صاحبة سيادة؟",
                "options": [
                    "القانون الخاص",
                    "القانون العام",
                    "القانون الدولي الخاص",
                    "القانون التجاري"
                ],
                "answer": "القانون العام"
            },
            {
                "text": "القانون المالي يُنظم:",
                "options": [
                    "العلاقات بين الأفراد فقط",
                    "مالية الدولة ومواردها وسبل تحصيلها",
                    "الجرائم والعقوبات",
                    "العلاقات الدولية"
                ],
                "answer": "مالية الدولة ومواردها وسبل تحصيلها"
            },
            {
                "text": "أي من الفروع التالية يُنظم درجات المحاكم وتشكيلها واختصاصها؟",
                "options": [
                    "القانون الجنائي",
                    "قانون المرافعات المدنية والتجارية",
                    "القانون الإداري",
                    "القانون الدستوري"
                ],
                "answer": "قانون المرافعات المدنية والتجارية"
            },
            {
                "text": "القانون الزراعي يُنظم:",
                "options": [
                    "النشاط التجاري في الدولة",
                    "النشاط الزراعي في الدولة",
                    "العلاقات بين الدول",
                    "العلاقات المالية بين الأفراد"
                ],
                "answer": "النشاط الزراعي في الدولة"
            },
            {
                "text": "أي من الفروع التالية يُعتبر من فروع القانون الخاص ويُنظم العلاقات ذات العنصر الأجنبي؟",
                "options": [
                    "القانون الدولي العام",
                    "القانون الدولي الخاص",
                    "القانون الدستوري",
                    "القانون الإداري"
                ],
                "answer": "القانون الدولي الخاص"
            },
            {
                "text": "القاعدة الآمرة هي:",
                "options": [
                    "القواعد التي يجوز للأفراد الاتفاق على مخالفتها",
                    "القواعد التي لا يجوز للأفراد الاتفاق على مخالفتها",
                    "تنظم العلاقات بين الدول فقط",
                    "تنظم العلاقات الاقتصادية فقط"
                ],
                "answer": "القواعد التي لا يجوز للأفراد الاتفاق على مخالفتها"
            },
            {
                "text": "القاعدة المكملة هي:",
                "options": [
                    "القواعد التي لا يجوز للأفراد الاتفاق على مخالفتها",
                    "القواعد التي يجوز للأفراد الاتفاق على مخالفتها",
                    "تنظم العلاقات الجنائية فقط",
                    "تفرض عقوبات مشددة"
                ],
                "answer": "القواعد التي يجوز للأفراد الاتفاق على مخالفتها"
            },
            {
                "text": "مثال على القواعد الآمرة:",
                "options": [
                    "قواعد البيع والشراء",
                    "قواعد الإيجار",
                    "القواعد الواردة في قانون العقوبات",
                    "قواعد الزواج التي يمكن تعديلها"
                ],
                "answer": "القواعد الواردة في قانون العقوبات"
            },
            {
                "text": "مثال على القواعد المكملة:",
                "options": [
                    "قواعد العقوبات",
                    "القاعدة التي تقضي بأن ثمن المبيع يكون مستحق الوفاء في المكان والزمان اللذين يُسلم فيهما المبيع",
                    "قواعد القتل العمد",
                    "قواعد السرقة"
                ],
                "answer": "القاعدة التي تقضي بأن ثمن المبيع يكون مستحق الوفاء في المكان والزمان اللذين يُسلم فيهما المبيع"
            },
            {
                "text": "القانون الجوي يُنظم:",
                "options": [
                    "العلاقات القانونية الناشئة عن الملاحة الجوية",
                    "العلاقات البحرية فقط",
                    "العلاقات البرية فقط",
                    "العلاقات بين الدول فقط"
                ],
                "answer": "العلاقات القانونية الناشئة عن الملاحة الجوية"
            },
            {
                "text": "القانون العام يختلف عن القانون الخاص في أنه:",
                "options": [
                    "يُنظم العلاقات بين الأفراد فقط",
                    "يُنظم العلاقات التي تكون الدولة طرفاً فيها باعتبارها صاحبة سيادة",
                    "لا يحتوي على قواعد إجرائية",
                    "يُنظم العلاقات التجارية فقط"
                ],
                "answer": "يُنظم العلاقات التي تكون الدولة طرفاً فيها باعتبارها صاحبة سيادة"
            }
            ] },
            { title: "المحاضرة الخامسة", desc: "بعض الالتزامات المهنية.",pdf: "lectures/lec5.pdf",pdf2:"qestions/Lecture_questions/lec5_questions.pdf",
             questions: 
           [
    {
        "text": "أى مما يلي يعتبر الفرق الأساسي بين الإعلام والمعلومات؟",
        "options": [
            "المعلومات تتطلب تفسيرًا إضافيًّا، بينما الإعلام مجرد نقل بيانات",
            "الإعلام له أصل تشريعي، بينما المعلومات لها أصل قضائي",
            "المعلومات تشمل المشورة، بينما الإعلام لا يشملها",
            "الإعلام يتطلب تقديم استشارات، بينما المعلومات لا تتطلب ذلك"
        ],
        "answer": "المعلومات تتطلب تفسيرًا إضافيًّا، بينما الإعلام مجرد نقل بيانات"
    },
    {
        "text": "ما هو مصدر الالتزام بالإعلام قبل التعاقد؟",
        "options": [
            "نصوص قانونية محددة فقط",
            "العقد بين الأطراف",
            "المبادئ العامة للقانون مثل مبدأ حسن النية",
            "الاتفاقات غير الرسمية بين الأطراف"
        ],
        "answer": "المبادئ العامة للقانون مثل مبدأ حسن النية"
    },
    {
        "text": "أيَّ مما يلي يُمثل فرقًا بين الالتزام بالإعلام قبل التعاقد والالتزام التعاقدي بالإعلام؟",
        "options": [
            "الالتزام بالإعلام قبل التعاقد يستمر حتى تنفيذ العقد",
            "الالتزام التعاقدي بالإعلام يكون سابقًا على العقد",
            "الالتزام بالإعلام قبل التعاقد ينشأ قبل العقد، بينما التعاقدي ينشأ بعده",
            "لا يوجد فرق بينهما، فهما مصطلحان لنفس الالتزام"
        ],
        "answer": "الالتزام بالإعلام قبل التعاقد ينشأ قبل العقد، بينما التعاقدي ينشأ بعده"
    },
    {
        "text": "ما الفرق بين الواجب والالتزام وفقًا لما جاء في المحاضرة؟",
        "options": [
            "الواجب يعتمد على العقد، بينما الالتزام يعتمد على القانون",
            "الالتزام له دائماً أصل تشريعي، بينما الواجب قد يكون أخلاقيًا فقط",
            "الواجب هو تصرف قانوني ملزم، بينما الالتزام اختياري",
            "الواجب يشير إلى قواعد أخلاقية عامة، بينما الالتزام يرتبط بعلاقة قانونية معينة"
        ],
        "answer": "الواجب يشير إلى قواعد أخلاقية عامة، بينما الالتزام يرتبط بعلاقة قانونية معينة"
    },
    {
        "text": "الالتزام بالإعلام قبل التعاقد يُعتبر:",
        "options": [
            "التزامًا لاحقًا على العقد",
            "جزءًا من التفاوض التعاقدي",
            "التزامًا أخلاقيًا فقط دون أثر قانوني",
            "التزامًا سابقًا على التعاقد ومرتبطًا بحسن النية"
        ],
        "answer": "التزامًا سابقًا على التعاقد ومرتبطًا بحسن النية"
    },
    {
        "text": "لماذا يُعتبر الالتزام بالإعلام قبل التعاقد ضرورة أخلاقية؟",
        "options": [
            "لأن المبادئ الأخلاقية تُشكل جزءًا من أي نظام قانوني",
            "لأنه يُساعد في تنفيذ العقود بدقة أكبر",
            "لأنه يمنع أي طرف من الحصول على معلومات أكثر من الآخر",
            "لأنه يحل محل العقد في بعض الحالات"
        ],
        "answer": "لأن المبادئ الأخلاقية تُشكل جزءًا من أي نظام قانوني"
    },
    {
        "text": "أيّ مما يلي يُعد ضرورة عملية للالتزام بالإعلام قبل التعاقد؟",
        "options": [
            "تحقيق التوازن في المعرفة بين الأطراف",
            "تقليل مدة المفاوضات التعاقدية",
            "إلزام الأطراف بإبرام العقد بسرعة",
            "تجنب التعاقد بين أطراف غير متساوين اقتصادياً"
        ],
        "answer": "تحقيق التوازن في المعرفة بين الأطراف"
    },
    {
        "text": "الالتزام بالتحذير يُعتبر:",
        "options": [
            "جزءًا من الالتزام بالإعلام قبل التعاقد",
            "منفصلاً تمامًا عن الالتزام بالإعلام",
            "التزامًا يُفرض على الطرف الأقل معرفة فقط",
            "شرطًا أساسيًا لإتمام العقد"
        ],
        "answer": "جزءًا من الالتزام بالإعلام قبل التعاقد"
    },
    {
        "text": "أيّ من التالي يُعد أحد أهداف الالتزام بالإعلام قبل التعاقد؟",
        "options": [
            "إلزام الأطراف بتنفيذ العقد قبل توقيعه",
            "تحقيق رضا المتعاقد بطريقة واعية ومستندة إلى المعلومات الصحيحة",
            "حماية الأطراف من الأخطاء القانونية فقط",
            "تقليل الحاجة إلى المحامين في العقود"
        ],
        "answer": "تحقيق رضا المتعاقد بطريقة واعية ومستندة إلى المعلومات الصحيحة"
    },
    {
        "text": "في حالة الإخلال بالالتزام بالإعلام قبل التعاقد، فإن المسؤولية تكون:",
        "options": [
            "مسؤولية عقدية فقط",
            "مسؤولية تقصيرية",
            "مسؤولية جنائية",
            "لا توجد مسؤولية قانونية"
        ],
        "answer": "مسؤولية تقصيرية"
    },
    {
        "text": "أيّ مما يلي يُعد تمييزًا بين المعلومة والمشورة؟",
        "options": [
            "المعلومة تتطلب تحليلًا إضافيًا، بينما المشورة لا تحتاج إلى تحليل",
            "المشورة تشمل تحفيزًا أو توجيهًا لاتخاذ قرار، بينما المعلومة محايدة",
            "لا يوجد فرق بينهما، فالمصطلحان مترادفان",
            "المعلومة قانونية، بينما المشورة أخلاقية"
        ],
        "answer": "المشورة تشمل تحفيزًا أو توجيهًا لاتخاذ قرار، بينما المعلومة محايدة"
    },
    {
        "text": "ما هو الفرق بين الالتزام بالإعلام قبل التعاقد والالتزام بالتحذير؟",
        "options": [
            "الإعلام يُركز على نقل المعلومات، بينما التحذير يتعلق بالتنبيه إلى المخاطر",
            "الالتزام بالتحذير أوسع نطاقًا من الالتزام بالإعلام",
            "لا يوجد فرق بينهما، فهما مصطلحان مترادفان",
            "الالتزام بالتحذير مطلوب في كل العقود، بينما الإعلام مطلوب في بعض العقود فقط"
        ],
        "answer": "الإعلام يُركز على نقل المعلومات، بينما التحذير يتعلق بالتنبيه إلى المخاطر"
    }
] },
            { title: "المحاضرة السادسة", desc: "بعض الالتزامات المهنية.", pdf: "lectures/lec6.pdf",pdf2:"qestions/Lecture_questions/lec6_questions.pdf",
             questions:
             [
    {
        "text": "أي من القيم التالية تساهم بها الأمانة في المجتمع؟",
        "options": [
            "انتشار الفوضى",
            "الحفاظ على الحقوق والودائع",
            "تقليل الثقة بين الأفراد",
            "غياب المسؤولية"
        ],
        "answer": "الحفاظ على الحقوق والودائع"
    },
    {
        "text": "ما نتيجة خيانة الأمانة وفقاً للحديث النبوي؟",
        "options": [
            "تقوية الإيمان",
            "دخول دائرة النفاق",
            "زيادة المحبة بين الأفراد",
            "تعزيز العلاقات الاجتماعية"
        ],
        "answer": "دخول دائرة النفاق"
    },
    {
        "text": "أي من الصور التالية تُمثل الأمانة؟",
        "options": [
            "حفظ الأسرار والمعلومات",
            "الغش في البيع والشراء",
            "كتمان الشهادة",
            "نشر الإشاعات"
        ],
        "answer": "حفظ الأسرار والمعلومات"
    },
    {
        "text": "ما العقوبة الاجتماعية لخيانة الأمانة؟",
        "options": [
            "زيادة الثقة بالشخص",
            "فقدان الثقة والاحترام",
            "الحصول على مناصب قيادية",
            "تعزيز العلاقات التجارية"
        ],
        "answer": "فقدان الثقة والاحترام"
    },
    {
        "text": "ماذا تعني الشفافية في اللغة؟",
        "options": [
            "القدرة على إخفاء المعلومات",
            "قابلية الجسم لإظهار ما وراءه",
            "تعمد تشويه الحقائق",
            "الاحتفاظ بالأسرار المهنية"
        ],
        "answer": "قابلية الجسم لإظهار ما وراءه"
    },
    {
        "text": "لماذا تُعد الشفافية ضرورية في أي مهنة؟",
        "options": [
            "لأنها تساعد في تضليل العملاء",
            "لأنها تعزز الوضوح والمصداقية",
            "لأنها تقلل من النزاهة",
            "لأنها تجعل المهني أقل موثوقية"
        ],
        "answer": "لأنها تعزز الوضوح والمصداقية"
    },
    {
        "text": "كيف يمكن للبائع أن يكون شفافا؟",
        "options": [
            "بإخفاء عيوب المنتج",
            "بالمبالغة في وصف المنتج",
            "بإظهار جميع المعلومات بوضوح",
            "بالتلاعب في الأسعار"
        ],
        "answer": "بإظهار جميع المعلومات بوضوح"
    },
    {
        "text": "ماذا يحدث عند غياب الشفافية في العلاقات المهنية؟",
        "options": [
            "زيادة الثقة بين الأطراف",
            "انتشار الاحتيال والغش",
            "تحسين سمعة الشركات",
            "تعزيز العلاقات التجارية"
        ],
        "answer": "انتشار الاحتيال والغش"
    },
    {
        "text": "كيف تؤثر الشفافية على المستهلك؟",
        "options": [
            "تجعله أكثر ثقة في المنتج",
            "تزيد من شكوكه في البضائع",
            "تجعله يعتمد على الإعلانات",
            "تقلل من وعيه بالتحليل"
        ],
        "answer": "تجعله أكثر ثقة في المنتج"
    },
    {
        "text": "لماذا تعتبر المشورة ضرورية في العلاقات المهنية؟",
        "options": [
            "لأنها تقوي الثقة بين المهني والعميل",
            "لأنها تزيد من الجمود",
            "لأنها تسبب مشاكل في التواصل",
            "لأنها غير ضرورية في العمل"
        ],
        "answer": "لأنها تقوي الثقة بين المهني والعميل"
    },
    {
        "text": "ماذا يحدث إذا لم يكن المهني صريحًا مع العملاء؟",
        "options": [
            "تزداد الثقة بينهما",
            "يؤدي إلى ضعف العلاقة بينهما",
            "يقل من النزاعات المستقبلية",
            "يعزز الشفافية"
        ],
        "answer": "يؤدي إلى ضعف العلاقة بينهما"
    },
    {
        "text": "ما الفرق بين الصدق والمشورة؟",
        "options": [
            "لا يوجد فرق بينهما",
            "الصدق يعني عدم الكذب، أما المشورة فتعني إظهار كل المعلومات",
            "المشورة هي جزء من الكذب",
            "المشورة تعني فقط قول الحقيقة عند السؤال"
        ],
        "answer": "الصدق يعني عدم الكذب، أما المشورة فتعني إظهار كل المعلومات"
    },
    {
        "text": "ما الفائدة الأساسية للمشورة في بيئة العمل؟",
        "options": [
            "زيادة النزاعات بين الموظفين",
            "تعزيز الثقة والوضوح",
            "زيادة الإشاعات",
            "إخفاء المشاكل"
        ],
        "answer": "تعزيز الثقة والوضوح"
    },
    {
        "text": "كيف تؤثر المشورة على علاقة العملاء بالمهني؟",
        "options": [
            "تقلل من مصداقية المهني",
            "تضعف الثقة بينهما",
            "تعزز الثقة والشفافية",
            "تزيد من المشاكل المستقبلية"
        ],
        "answer": "تعزز الثقة والشفافية"
    }
] }
        ];

       // ==========================================
        // 2. قاعدة بيانات الميدتيرم
        // ==========================================
        var midterms = [
            { title: "Midterm Exam - 2022 - Computer & Ethics",pdf:"qestions/mid/2022/Midterm_Exam_2022_Computer_Ethics.pdf" ,
            interactive: true, 
            questions: [
    {
        "text": "1. يجوز أن تخاطب القاعدة القانونية شخصاً واحداً فقط أو فئة معينة من الأشخاص",
        "options": ["العبارة صحيحة", "العبارة خاطئة"],
        "answer": "العبارة صحيحة"
    },
    {
        "text": "2. الفصل من الوظيفة العامة يمثل إحدى صور الجزاء (جنائي، إداري، مدني، لا شيء مما سبق)",
        "options": ["جنائي", "إداري", "مدني", "لا شيء مما سبق"],
        "answer": "إداري"
    },
    {
        "text": "3. النصل أن يصاغ الفرد المخاطب بالقاعدة القانونية لضمونها بالإرادة واختياره",
        "options": ["العبارة صحيحة", "العبارة خاطئة"],
        "answer": "العبارة صحيحة"
    },
    {
        "text": "4. لا يمكن وصف قواعد الأخلاق أنها عامة مجردة",
        "options": ["العبارة صحيحة", "العبارة خاطئة"],
        "answer": "العبارة خاطئة"
    },
    {
        "text": "5. يتولى توقيع الجزاء القانوني على المخالف للقاعدة القانونية (المضرور، المجني عليه، السلطة العامة للدولة، جميع ما سبق)",
        "options": ["المضرور", "المجني عليه", "السلطة العامة للدولة", "جميع ما سبق"],
        "answer": "السلطة العامة للدولة"
    },
    {
        "text": "6. يصنف القانون في الإسلام إلى (تحقيق العدل - تحقيق الاستقرار - تحقيق الأمن - كل ما سبق)",
        "options": ["تحقيق العدل", "تحقيق الاستقرار", "تحقيق الأمن", "كل ما سبق"],
        "answer": "كل ما سبق"
    },
    {
        "text": "7. تعيين شخصاً معيناً باسمه في وظيفة معينة يكون مقتضى (قاعدة قانونية - قرار إداري - قاعدة اجتماعية - لا شيء مما سبق)",
        "options": ["قاعدة قانونية", "قرار إداري", "قاعدة اجتماعية", "لا شيء مما سبق"],
        "answer": "قرار إداري"
    },
    {
        "text": "8. تتميز قواعد الدين بكونها تصف إلى غاية اسمى وأجل مما تصف إليه قواعد القانون أو الأخلاق",
        "options": ["العبارة صحيحة", "العبارة خاطئة"],
        "answer": "العبارة صحيحة"
    },
    {
        "text": "9. يشترط أن يكون الجزاء القانوني (مادي مباشر - معنوي غير مباشر - معنوي مباشر - مادي غير مباشر)",
        "options": ["مادي مباشر", "معنوي غير مباشر", "معنوي مباشر", "مادي غير مباشر"],
        "answer": "مادي مباشر"
    },
    {
        "text": "10. يمثل إحدى صور الجزاء الجنائي (الغرامة - البطلان - الفسخ - التعويض)",
        "options": ["الغرامة", "البطلان", "الفسخ", "التعويض"],
        "answer": "الغرامة"
    },
    {
        "text": "11. تخاطب القاعدة القانونية جميع أفراد المجتمع بأسمائهم وذواتهم",
        "options": ["العبارة صحيحة", "العبارة خاطئة"],
        "answer": "العبارة خاطئة"
    },
    {
        "text": "12. يشترط في القاعدة القانونية أن تتصف بكونها (اجتماعية - عامة - مكتوبة - لا شيء مما سبق)",
        "options": ["اجتماعية", "عامة", "مكتوبة", "لا شيء مما سبق"],
        "answer": "عامة"
    },
    {
        "text": "13. يعتبر تبادل التهاني والتزاور في المناسبات صور قواعد (القانون - الدين - الأخلاق - المجاملات الاجتماعية)",
        "options": ["القانون", "الدين", "الأخلاق", "المجاملات الاجتماعية"],
        "answer": "المجاملات الاجتماعية"
    },
    {
        "text": "14. لا يمكن أن تكون القاعدة القانونية ملزمة ما لم تقترن بجزاء",
        "options": ["العبارة صحيحة", "العبارة خاطئة"],
        "answer": "العبارة صحيحة"
    },
    {
        "text": "15. إذا ما أرتكب الفرد سلوكاً مجرماً دون أن تتحقق نتيجته المسبب لها فلا يمكن معاقبته",
        "options": ["العبارة صحيحة", "العبارة خاطئة"],
        "answer": "العبارة خاطئة"
    },
    {
        "text": "16. تعتبر قواعد الأخلاق (السلوك الداخلي للفرد - السلوك الداخلي والخارجي للفرد - الخارجي للفرد - لا شيء مما سبق)",
        "options": ["السلوك الداخلي للفرد", "السلوك الداخلي والخارجي للفرد", "الخارجي للفرد", "لا شيء مما سبق"],
        "answer": "السلوك الداخلي للفرد"
    },
    {
        "text": "17. لا يمكن وصف قواعد الدين بأنها قواعد ملزمة نظراً لأن الجزاء فيها أخروي مؤجل",
        "options": ["العبارة صحيحة", "العبارة خاطئة"],
        "answer": "العبارة خاطئة"
    },
    {
        "text": "18. تخاطب القاعدة القانونية سلوك الفرد دوماً ولا تتطرق إلى نواياه بشكل مطلق",
        "options": ["العبارة صحيحة", "العبارة خاطئة"],
        "answer": "العبارة صحيحة"
    },
    {
        "text": "19. إذا نوى شخص قتل آخر ثم عدل عن نيته تلك دون أن يرتكب هذا السلوك الإجرامي فلا مجال لمعاقبته قانوناً",
        "options": ["العبارة صحيحة", "العبارة خاطئة"],
        "answer": "العبارة صحيحة"
    },
    {
        "text": "20. القوانين التي تصلح لتيسير نظام الحياة في مجتمع ما من وقت معين لا تكون صالحة لذلك طوال الوقت بشكل أبدي",
        "options": ["العبارة صحيحة", "العبارة خاطئة"],
        "answer": "العبارة صحيحة"
    },
    {
        "text": "21. تتضمن قواعد الدين (علاقة الفرد بربه فقط - علاقة الفرد بنفسه - علاقة الفرد بالآخرين - كل ما سبق)",
        "options": ["علاقة الفرد بربه فقط", "علاقة الفرد بنفسه", "علاقة الفرد بالآخرين", "كل ما سبق"],
        "answer": "كل ما سبق"
    },
    {
        "text": "22. تتشابه قواعد الدين مع قواعد القانون في أنها (عامة مجردة - مكتوبة - الجزاء فيها فوري مباشر - لا شيء مما سبق)",
        "options": ["عامة مجردة", "مكتوبة", "الجزاء فيها فوري مباشر", "لا شيء مما سبق"],
        "answer": "عامة مجردة"
    },
    {
        "text": "23. يهدف الجزاء القانوني إلى (الردع العام - الردع الخاص - عقاب مخالف القاعدة - كل ما سبق)",
        "options": ["الردع العام", "الردع الخاص", "عقاب مخالف القاعدة", "كل ما سبق"],
        "answer": "كل ما سبق"
    },
    {
        "text": "24. تمثل قواعد القانون غالبية في حد ذاتها",
        "options": ["العبارة صحيحة", "العبارة خاطئة"],
        "answer": "العبارة صحيحة"
    },
    {
        "text": "25. يسعى واضعو القانون إلى رفع الكثير من قواعد الأخلاق إلى مصاف القواعد القانونية",
        "options": ["العبارة صحيحة", "العبارة خاطئة"],
        "answer": "العبارة صحيحة"
    }
]

},
            { title: "Midterm Exam - 2023 - Computer & Ethics",pdf:"qestions/mid/2023/Midterm_Exam_2023_Computer_Ethics.pdf" ,
                 interactive: true, 
            
            questions: [
 {
            "text": "لا يشترط لتوافر عنصر الإلزام للقاعدة القانونية أن تقترن بجزاء يوقع على المخالف",
            "options": [
                "True",
                "False"
            ],
            "answer": "False"
        },
        {
            "text": "الجزاء ليس عنصرًا من عناصر القاعدة القانونية",
            "options": [
                "True",
                "False"
            ],
            "answer": "False"
        },
        {
            "text": "تعد قواعد القانون قواعد عامة ومجردة",
            "options": [
                "True",
                "False"
            ],
            "answer": "True"
        },
        {
            "text": "يهتم القانون بالنوايا الداخلية إذا ظهرت في صورة سلوك خارجي",
            "options": [
                "True",
                "False"
            ],
            "answer": "True"
        },
        {
            "text": "يعد البطلان من صور الجزاء المدني",
            "options": [
                "True",
                "False"
            ],
            "answer": "True"
        },
        {
            "text": "يعد التعويض من صور الجزاء المدني",
            "options": [
                "True",
                "False"
            ],
            "answer": "True"
        },
        {
            "text": "يهدف الجزاء الجنائي إلى إعادة التوازن بين الذمم المالية",
            "options": [
                "True",
                "False"
            ],
            "answer": "False"
        },
        {
            "text": "يعد الأمر الصادر بمنع شخص معين الجنسية قاعدة قانونية",
            "options": [
                "True",
                "False"
            ],
            "answer": "True"
        },
        {
            "text": "تعد قواعد تنظيم الجامعات من قبيل القواعد القانونية",
            "options": [
                "True",
                "False"
            ],
            "answer": "True"
        },
        {
            "text": "لا تعتبر القواعد المنظمة لمركز رئيس الجمهورية قواعد قانونية لأنها تخاطب فردًا واحدًا",
            "options": [
                "True",
                "False"
            ],
            "answer": "False"
        },
        {
            "text": "يحق لأي فرد من أفراد المجتمع أن يوقع الجزاء بنفسه",
            "options": [
                "True",
                "False"
            ],
            "answer": "False"
        },
        {
            "text": "يخاطب القانون الأشخاص بصفاتهم لا بذواتهم",
            "options": [
                "True",
                "False"
            ],
            "answer": "True"
        },
        {
            "text": "يعد الجزاء السياسي من صور الجزاءات القانونية",
            "options": [
                "True",
                "False"
            ],
            "answer": "True"
        },
        {
            "text": "يعد الإعدام من صور الجزاء المدني",
            "options": [
                "True",
                "False"
            ],
            "answer": "False"
        },
        {
            "text": "ينفرد القانون وحده بتنظيم جميع مظاهر السلوك الإنساني في المجتمع",
            "options": [
                "True",
                "False"
            ],
            "answer": "False"
        },
        {
            "text": "يعد اللوم من صور الجزاء الإداري",
            "options": [
                "True",
                "False"
            ],
            "answer": "False"
        },
        {
            "text": "يعد القرار الصادر بنقل أحد العاملين من إدارة إلى أخرى من قبيل القواعد القانونية",
            "options": [
                "True",
                "False"
            ],
            "answer": "False"
        },
        {
            "text": "لا يعد القانون غاية في حد ذاته بل وسيلة لحماية حقوق الأفراد وحرياتهم",
            "options": [
                "True",
                "False"
            ],
            "answer": "True"
        },
        {
            "text": "يقع جزاء الفسخ عند امتناع أحد أطراف العلاقة عن تنفيذ التزاماته",
            "options": [
                "True",
                "False"
            ],
            "answer": "True"
        },
        {
            "text": "تتولى السلطة العامة إجبار الأفراد على الالتزام بقواعد القانون",
            "options": [
                "True",
                "False"
            ],
            "answer": "True"
        },
        {
            "text": "تعد قواعد تنظيم مهنة المحاماة من قبيل القواعد القانونية",
            "options": [
                "True",
                "False"
            ],
            "answer": "True"
        },
        {
            "text": "يعد الجزاء الجنائي أشد الجزاءات القانونية",
            "options": [
                "True",
                "False"
            ],
            "answer": "True"
        },
        {
            "text": "تعد قواعد القانون قواعد سلوك اجتماعي",
            "options": [
                "True",
                "False"
            ],
            "answer": "True"
        },
        {
            "text": "يقصد بالقانون، بمعناه الواسع، مجموعة القواعد القانونية التي تنظم بصورة ملزمة سلوك الأفراد في المجتمع",
            "options": [
                "True",
                "False"
            ],
            "answer": "True"
        },
        {
            "text": "كقاعدة عامة، لا يهتم القانون بالنوايا والبواعث الداخلية",
            "options": [
                "True",
                "False"
            ],
            "answer": "True"
        }
             ] },
            { title: "Midterm Computer & Ethics - National – 2024", pdf:"qestions/mid/2024/Computer_Ethics_National_2024.pdf" ,
            interactive: true, 
            questions: [
           {
        "text": "يجوز أن تخاطب القاعدة القانونية شخصاً واحداً فقط أو فئة معينة من الأشخاص",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    },
    {
        "text": "يشترط في الجزاء المتطلب في القاعدة القانونية أن يكون جزاء مادياً",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "يمكن تحقيق الاستقرار في بعض المجتمعات في ظل تطبيق قوانين ظالمة",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "تهتم القاعدة القانونية بوصفها قاعدة منظمة للسلوك الإنساني بالنوايا والبواعث الداخلية التي تظل حبيسة في الصدور",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "يحقق القانون الاستقرار داخل المجتمع عندما يطبق على المحكومين فقط",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "لا تعتبر قواعد القانون المنظمة لمنصب رئيس الجمهورية قواعد عامة مجردة لأنها تخاطب فرداً واحداً",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "من صور الجزاء الجنائي التنفيذ بمقابل أو التعويض",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "من صور الجزاء الإداري حق رئيس الدولة في حل مجلس النواب",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "العدل التبادلي وهو ذلك العدل الذي يجب للفرد في مواجهة المجتمع الذي يعيش فيه",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "الجزاء الإداري هو العقوبة التي توقع تنفيذاً لحكم قضائي على من ثبتت مسؤوليته عن الجريمة",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "يتولى توقيع الجزاء في القاعدة القانونية الشخص بنفسه",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "يقوم العدل التبادلي على فكرة المساواة التامة أو المطلقة",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    },
    {
        "text": "تتميز القاعدة القانونية بأنها قاعدة عامة مجردة",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    },
    {
        "text": "من وظائف القانون تحقيق الأمن والعدالة داخل المجتمع",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    },
    {
        "text": "يقتضي العدل الاجتماعي تطبيق المساواة النسبية أو التقريبية بين أفراد المجتمع",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    },
    {
        "text": "يستعمل لفظ القانون للتعبير عن كل قاعدة ثابتة وغير مطردة",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "لا يعد القانون غاية في حد ذاته، إنما هو وسيلة يقصد من ورائها حماية حقوق الأفراد وحرياتهم",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    },
    {
        "text": "التعويض القانوني هو الذي يقدره القاضي بحسب ما لحق الشخص من خسارة وما فاته من كسب",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "تعد القاعدة القانونية بمثابة قاعدة تقويمية وهي بذلك تتفق مع القاعدة التقريرية التي تقرر الواقع",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "القانون والمجتمع أمران متلازمان لا غناء أحدهما عن الآخر",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    },
    {
        "text": "يتطلب الجزاء في القاعدة القانونية توقيعه على المخالف في الحال",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    },
    {
        "text": "تحرص الدول الديمقراطية المعاصرة في دساتيرها وقوانينها على رسم حدود سلطات الحاكم لتحقيق الاستقرار داخل المجتمع",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    },
    {
        "text": "تقسم الجرائم من حيث درجة جسامتها إلى أربعة أنواع",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "يقوم العدل التوزيعي على المساواة التامة بين أفراد المجتمع",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "من صور الجزاء المدني البطلان",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    }            ]
         },
            { title: "Midterm 2025 - General - Dr. Muhammed Abdel3leem",pdf:"qestions/mid/2025/Midterm_2025_General_Dr_Muhammed_Abdel3leem.pdf" ,
            interactive: true,          
            questions: [
    {
        "text": "العدل التوزيعي هو الذي يجب للفرد في مواجهة المجتمع الذي يعيش فيه",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "يشترط في الجزاء في القاعدة القانونية أن يكون جزاء معنوياً",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "التعويض القانوني هو الذي يقدره القاضي بحسب ما لحق الشخص من خسارة وما فاته من كسب",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    },
    {
        "text": "تهتم القاعدة القانونية بوصفها قاعدة منظمة للسلوك الإنساني بالنوايا والبواعث الداخلية التي تظل حبيسة في الصدور",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "القانون في المعنى الضيق هو مجموعة القواعد القانونية التي تنظم سلوك الأفراد داخل المجتمع",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    },
    {
        "text": "يمكن تحقيق الاستقرار في بعض المجتمعات في ظل تطبيق قوانين ظالمة",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "تتميز القاعدة القانونية بأنها قاعدة سلوك اجتماعي",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    },
    {
        "text": "تحرص الدول الديمقراطية المعاصرة في دساتيرها وقوانينها على رسم حدود سلطات الحاكم لتحقيق الاستقرار داخل المجتمع",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    },
    {
        "text": "لا تعتبر قواعد القانون المنظمة لمنصب رئيس الجمهورية قواعد عامة مجردة لأنها تخاطب فرداً واحداً",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "العدل التبادلي هو ما يجب على الفرد في مواجهة غيره من الأفراد في إطار العلاقات العقدية",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    },
    {
        "text": "تقسم الجرائم من حيث درجة جسامتها إلى ثلاثة أنواع",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    },
    {
        "text": "يتسم قانون تنظيم الجامعات بالعموم والتجريد",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    },
    {
        "text": "الجزاء المدني هو العقوبة التي تتوقع تنفيذاً لحكم قضائي على من ثبتت مسؤوليته عن الجريمة",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "يقوم العدل التوزيعي على المساواة التامة بين أفراد المجتمع",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "يستخدم لفظ القانون للتعبير عن كل قاعدة غير ثابتة ومطردة",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "من وظائف القانون تحقيق الاستقرار في المجتمع",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    },
    {
        "text": "من صور الجزاء السياسي حق رئيس الدولة في حل مجلس النواب",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    },
    {
        "text": "يتميز الجزاء في القاعدة القانونية بأنه حال غير مؤجل",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "القانون والمجتمع أمران متلازمان لا غنى لأحدهما عن الآخر",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    },
    {
        "text": "يقتضي العدل الاجتماعي تطبيق المساواة النسبية أو التقريبية بين أفراد المجتمع",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "من صور الجزاء المدني المصادرة",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "يقوم العدل التبادلي على فكرة المساواة النسبية",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    },
    {
        "text": "من صور الجزاء المدني التنفيذ أو مقابل التعويض",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    },
    {
        "text": "تعد القاعدة القانونية بمثابة قاعدة تقويمية وهي تتفق مع القاعدة التقريرية التي تقرر الواقع",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "يجوز أن تخاطب القاعدة القانونية شخصاً واحداً فقط أو فئة معينة من الأشخاص",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    }
]
        },
            { title: "Midterm 2025 - National - Dr. Muhammed Abdel3leem", pdf:"qestions/mid/2025/Midterm_2025_National_Dr_Muhammed_Abdel3leem.pdf" ,
           interactive: true, 
            questions: [
      {
                "text": "الجزاء السياسي صور من حق رئيس الدولة في حل مجلس النواب",
                "options": [
                    "صح",
                    "خطأ"
                ],
                "answer": "صح"
            },
            {
                "text": "العدل التبادلي وهو ذلك العدل الذي يجب على الفرد في مواجهة المجتمع الذي يعيش فيه",
                "options": [
                    "صح",
                    "خطأ"
                ],
                "answer": "خطأ"
            },
            {
                "text": "الفسخ وهو الجزاء الذي يترتب في حالة إخلال أحد المتعاقدين بالتزاماته العقدية",
                "options": [
                    "صح",
                    "خطأ"
                ],
                "answer": "صح"
            },
            {
                "text": "لا تعتبر القواعد المنظمة لمنصب رئيس الجمهورية قواعد عامة مجردة لأنها",
                "options": [
                    "صح",
                    "خطأ"
                ],
                "answer": "صح"
            },
            {
                "text": "يتميز الجزاء في القاعدة القانونية بأنه جزاء منظم",
                "options": [
                    "صح",
                    "خطأ"
                ],
                "answer": "خطأ"
            },
            {
                "text": "من صور الجزاء الإداري التنفيذ مقابل التعويض",
                "options": [
                    "صح",
                    "خطأ"
                ],
                "answer": "صح"
            },
            {
                "text": "تعد القاعدة القانونية بمثابة قاعدة تقويمية وهي تختلف مع القاعدة التقريرية التي تقرر واقع",
                "options": [
                    "صح",
                    "خطأ"
                ],
                "answer": "صح"
            },
            {
                "text": "من وظائف القانون تحقيق الاستقرار والعدل في المجتمع",
                "options": [
                    "صح",
                    "خطأ"
                ],
                "answer": "صح"
            },
            {
                "text": "العدل الاجتماعي وهو ما يجب على الفرد في مواجهة غيره من أفراد المجتمع في إطار العلاقات العقدية",
                "options": [
                    "صح",
                    "خطأ"
                ],
                "answer": "صح"
            },
            {
                "text": "الجزاء في القاعدة القانونية هو الأثر الذي يرتبه القانون على مخالفة مضمون القاعدة القانونية",
                "options": [
                    "صح",
                    "خطأ"
                ],
                "answer": "صح"
            },
            {
                "text": "يشترط في الجزاء المتطلب في القاعدة القانونية أن يكون جزاء",
                "options": [
                    "صح",
                    "خطأ"
                ],
                "answer": "صح"
            },
            {
                "text": "للقانون في معناه الواسع هو مجموعة القواعد القانونية التي تنظم سلوك الأفراد داخل المجتمع",
                "options": [
                    "صح",
                    "خطأ"
                ],
                "answer": "خطأ"
            },
            {
                "text": "العدل الاجتماعي وهو العدل الذي يقتضي توزيع الواجبات والخدمات العامة",
                "options": [
                    "صح",
                    "خطأ"
                ],
                "answer": "صح"
            },
            {
                "text": "الجزاء الجنائي هو العقوبة التي توقع حكم قضائي على من ثبتت مسؤوليته عن الجريمة",
                "options": [
                    "صح",
                    "خطأ"
                ],
                "answer": "صح"
            },
            {
                "text": "العدل الاجتماعي يقتضي تطبيق المساواة النسبية أو التقريبية",
                "options": [
                    "صح",
                    "خطأ"
                ],
                "answer": "صح"
            },
            {
                "text": "من صور الجزاء المدني الحبس",
                "options": [
                    "صح",
                    "خطأ"
                ],
                "answer": "خطأ"
            },
            {
                "text": "القانون والمجتمع أمران مختلفان يستغني أحدهما عن الآخر",
                "options": [
                    "صح",
                    "خطأ"
                ],
                "answer": "خطأ"
            },
            {
                "text": "العدل التوزيعي يقوم على المساواة التامة",
                "options": [
                    "صح",
                    "خطأ"
                ],
                "answer": "صح"
            }
        ]
              }
               ];

        // ==========================================
        // 3. قاعدة بيانات الفاينل
        // ==========================================
        var finals = [
            { title: "Final Exam - 2023 - Computer & Ethics",pdf:"qestions/final/2023/Final_Exam_2023_Computer_Ethics.pdf" ,
                interactive: true, 

             questions:[
    {
        "text": "لا يجوز الاتفاق على مخالفة القاعدة الآمرة.",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة صحيحة"
    },
    {
        "text": "يعد القانون .................... أحد فروع القانون العام",
        "options": [
            "الدستوري",
            "البحري",
            "التجاري"
        ],
        "answer": "الدستوري"
    },
    {
        "text": "قد ينتج ................ عن ذات السلوك الاجرامي",
        "options": [
            "جزاء مدني فقط",
            "جزاء جنائي فقط",
            "جزاء مدني وجنائي"
        ],
        "answer": "جزاء مدني وجنائي"
    },
    {
        "text": "تختلف القاعدة الدينية عن القاعدة القانونية من حيث",
        "options": [
            "طبيعة الجزاء",
            "الجزاء",
            "العمومية والتجريد"
        ],
        "answer": "طبيعة الجزاء"
    },
    {
        "text": "لا يجوز تقديم النص القانونى على اتفاق الأشخاص فى القاعدة القانونية المكملة",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة صحيحة"
    },
    {
        "text": "تعد فكرة النظام العام فكرة ثابتة لا تتغير بتغير الزمان والمكان",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة خاطئة"
    },
    {
        "text": "من موضوعات القانون المالى",
        "options": [
            "بيان شكل الدولة",
            "بيان بتنظيم مالية الدولة وتحديد مواردها وسبل تحصيلها وأجه انفاقها",
            "تحديد الأفعال المجرمة قانوناً وعقوبتها"
        ],
        "answer": "بيان بتنظيم مالية الدولة وتحديد مواردها وسبل تحصيلها وأجه انفاقها"
    },
    {
        "text": "قانون العمل هو أحد فروع القانون العام المختص بتنظيم العلاقة بين العمال و أرباب الأعمال",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة خاطئة"
    },
    {
        "text": "الطبيب الذى لا يخبرمريضه بخطر حصول شلل له فى عصب الوجه نتيجة للعملية سيجرىها,لا يعد مقصراً على نحو يوجب مسئوليته",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة خاطئة"
    },
    {
        "text": "تعد القاعدة القانونية من قواعد القانون العام, إذا كانت الدولة أحد أطرافها طرفاً فى العلاقة القانونية التى تنظمها هذه القاعدة, وذلك وفقاً لـ",
        "options": [
            "معيار أطراف العلاقة",
            "معيار المصلحة",
            "معيارصفة أطراف العلاقة"
        ],
        "answer": "معيار أطراف العلاقة"
    },
    {
        "text": "يكون الاثبات فى المسائل................ بكافة الطرق أياً كانت قيمة المعاملة",
        "options": [
            "المدنية",
            "التجارية",
            "كلاهما"
        ],
        "answer": "التجارية"
    },
    {
        "text": "قد تكون النية سبباً لتشديد العقوبة على السلوك الاجرامي",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة صحيحة"
    },
    {
        "text": "تكون القاعدة القانونية متصلة بالصيغة اللازمية إذا كانت آمرة فقط",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة خاطئة"
    },
    {
        "text": "التزام المحامي في الدفاع عن موكله هو التزام بتحقيق غاية",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة خاطئة"
    },
    {
        "text": "النوايا والبواعث الداخلية التى لم تترجم إلى أقوال أو أفعال لا يحساب عليها القانون مهما بلغت درجة تجاوزها",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة صحيحة"
    },
    {
        "text": "يعد الجزاء المترتب على مخالفة قواعد القانون",
        "options": [
            "جزاء معنوي",
            "جزاء مادي",
            "لاشئ مما سبق"
        ],
        "answer": "جزاء مادي"
    },
    {
        "text": "حرية المريض في قبول العمل الطبى أو رفضه حرية مطلقةً",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة خاطئة"
    },
    {
        "text": "يشترط لإجراء التجارب الطبية على المرضى أن يكون رضائه حراً مستنيراً",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة صحيحة"
    },
    {
        "text": "التزام الطبيب بعلاج المريض",
        "options": [
            "التزام بتحقيق غاية",
            "التزام ببذل عناية",
            "إعطاء شئ"
        ],
        "answer": "التزام ببذل عناية"
    },
    {
        "text": "من صور الجزاء الجنائى",
        "options": [
            "البطلان",
            "التعويض",
            "الغرامة"
        ],
        "answer": "الغرامة"
    },
    {
        "text": "يقصد بـ...... إظهار بمواطن الأمور بكل صراحة ووضوح, للكشف عنها بلا مداراة أو صورية",
        "options": [
            "التزام بالصدق",
            "التزام بالشفافية",
            "التزام بالأمانة"
        ],
        "answer": "التزام بالشفافية"
    },
    {
        "text": "هى مجموعة من القواعد التى يجوز للأفراد الاتفاق على مخالفتها ولا يقع باطلاً كل اتفاق يخالف ذلك",
        "options": [
            "قواعد القانون العام",
            "القاعدة القانونية الآمرة",
            "القاعدة القانونية المكملة"
        ],
        "answer": "القاعدة القانونية المكملة"
    },
    {
        "text": "يقتصر تطبيق ......... على العاملين بالجهاز الإدارى للدولة",
        "options": [
            "الجزاء الإدارى",
            "الجزاء الجنائى",
            "الجزاء المدنى"
        ],
        "answer": "الجزاء الإدارى"
    },
    {
        "text": "يشترط على الطبيب أن يراعي عند وصفه أدويةً معينةً لمريضه مناسبتها للظروف الصحية والجسمانية لهذا المريض",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة صحيحة"
    },
    {
        "text": "لا يفترض التضامن بين المدينيين في المعاملات التجارية",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة خاطئة"
    },
    {
        "text": "لا ينتهي عقد المحامي مع موكله بموت أحدهما أو كليهما, بل ينتقل إلى الورثة",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة خاطئة"
    },
    {
        "text": "يلعب الالتزام بالإعلام قبل التعاقد دوراً مهماً في تحقيق التوازن بين الراغبين في التعاقد",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة صحيحة"
    },
    {
        "text": "ذلك العدل الذى يقرر لمصلحة الفرد فى مواجهة المجتمع",
        "options": [
            "العدل التبادلي",
            "العدل التوزيعي",
            "العدل الاجتماعي"
        ],
        "answer": "العدل التوزيعي"
    },
    {
        "text": "يعد القانون المدنى من فروع القانون الخاص",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة صحيحة"
    },
    {
        "text": "لا يجوز للمحامي الاتفاق مع موكله على إعفائه من المسئولية العقدية الناتجة عن عدم تنفيذ التزاماته في العقد إذا كان الخطأ",
        "options": [
            "جسيم",
            "عمدى",
            "كل ما سبق"
        ],
        "answer": "كل ما سبق"
    },
    {
        "text": "يسمى الجزاء الموقع من الأجهزة الإدارية العامة فى الدولة على العاملين لديها عند ارتكابهم لمخالفات إدارية بالجزاء السياسى",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة خاطئة"
    },
    {
        "text": "يسمح للطبيب بالتدخل العلاجي دون الحصول على موافقة المريض فى",
        "options": [
            "حالة المريض تقتضى التدخل السريع",
            "حالة التطعيم ضد الأمراض المعدية",
            "كلاهما"
        ],
        "answer": "كلاهما"
    },
    {
        "text": "هي الجرائم المعاقب عليها بالحبس مدة لا تقل عن 24 ساعة ولاتزيد عن ثلاث سنوات",
        "options": [
            "الجنح",
            "الجنايات",
            "المخالفات"
        ],
        "answer": "الجنح"
    },
    {
        "text": "تسمى القواعد التى تنظم شكل الدولة ونظام الحكم فيها بالقانون",
        "options": [
            "الدستوري",
            "الإداري",
            "المدنى"
        ],
        "answer": "الدستوري"
    },
    {
        "text": "يجوز الجمع بين المحاماة والعمل",
        "options": [
            "بالتجارة",
            "كرئيس مجلس إدارة شركة مساهمة",
            "كأستاذ قانون فى الجامعات المصرية"
        ],
        "answer": "كأستاذ قانون فى الجامعات المصرية"
    },
    {
        "text": "من مظاهر تقصير الطبيب فى أداء عمله",
        "options": [
            "أن يتغيب الطبيب المكلف من قبل رب العمل بالتواجد في ميدان العمل",
            "متابعة مريضه الذي بدأ معالجته ولم يزل خاضعاً تحت العلاج أو الجراحة",
            "ضمان سلامة المريض من الأدوات أو الأجهزة التى يستعملها"
        ],
        "answer": "أن يتغيب الطبيب المكلف من قبل رب العمل بالتواجد في ميدان العمل"
    },
    {
        "text": "قواعد القانون تنظم علاقة الإنسان",
        "options": [
            "مع نفسه ومع غيره",
            "مع ربه",
            "جميع ما سبق"
        ],
        "answer": "مع نفسه ومع غيره"
    },
    {
        "text": "يختص ................ بنظر المنازعات المدنية والتجارية",
        "options": [
            "القضاء العادى",
            "القضاء الإداري",
            "كلاهما"
        ],
        "answer": "القضاء العادى"
    },
    {
        "text": "المسئولية الناشئة عن الالتزام بالإعلام قبل التعاقد",
        "options": [
            "مسئولية عقدية",
            "مسئولية تقصيرية",
            "لا شئ مما سبق"
        ],
        "answer": "مسئولية تقصيرية"
    },
    {
        "text": "تعد قواعد قانون المرافعات من قبيل القواعد الموضوعية التى يستند إليها القاضى فى حل النزاعات",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة خاطئة"
    },
    {
        "text": "تعد عقوبة الخصم من الراتب من صور الجزاء",
        "options": [
            "الجنائى",
            "السياسي",
            "الإداري"
        ],
        "answer": "الإداري"
    },
    {
        "text": "يقع جزاء......................عند امتناع أحد أطراف العقد عن تنفيذ التزاماته",
        "options": [
            "فسخ العقد",
            "البطلان النسبى للعقد",
            "البطلان المطلق للعقد"
        ],
        "answer": "فسخ العقد"
    },
    {
        "text": "إذا قام الطبيبُ بقطع إصبع شخص بهدف إعانته على الإفلات من واجب أداء الخدمة العسكرية لا تنعقد بذلك مسئوليته القانونية",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة خاطئة"
    },
    {
        "text": "يعتبر بطلان العقد كجزاء لتخلف أحد أركانه جزاءً",
        "options": [
            "مدنياً",
            "جنائياً",
            "إدارياً"
        ],
        "answer": "مدنياً"
    },
    {
        "text": "لا تعتبر قواعد القانون المنظم لمنصب رئيس الجمهورية قواعد عامة مجردة نظراً لأنها تخاطب فرداً واحداً",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة خاطئة"
    },
    {
        "text": "القانون ليس وحده هو الذى ينفرد بتنظيم علاقات الأفراد",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة صحيحة"
    },
    {
        "text": "يسأل المهني عن أخطائه المهنية وفقاً لمعيار الشخص المحترف",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة خاطئة"
    },
    {
        "text": "يعد امتناع رجل الإسعاف طبيباً كان أو ممرضاً عن إسعاف المصابين في حوادث الطرق العامة ونقلهم إلى المستشفى خطأً تقصيرياً يستوجب مسئوليته",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة صحيحة"
    },
    {
        "text": "تعد الاستعانة بالمحامي في الجنايات أمراً جوازياً",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة خاطئة"
    },
    {
        "text": "لا يكون الطبيب مسئولاً قانونياً إذا نقل لمريضه دما ملوثاً من متبرع دون أن يتأكد من سلامة هذا الدم وخلوه من حمل أية أمراض معدية لمريضه",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة خاطئة"
    }
]         }  ,
            { 
                title: "Final Computer & Ethics - National – 2024", pdf:"qestions/final/2024/Computer_Ethics_National_2024.pdf" ,
                interactive: true, 
                questions: [
    {
        "text": "لا يجوز الاتفاق على مخالفة القاعدة الآمرة.",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة صحيحة"
    },
    {
        "text": "يعد القانون .................... أحد فروع القانون العام",
        "options": [
            "الدستوري",
            "البحري",
            "التجاري"
        ],
        "answer": "الدستوري"
    },
    {
        "text": "قد ينتج ................ عن ذات السلوك الاجرامي",
        "options": [
            "جزاء مدني فقط",
            "جزاء جنائي فقط",
            "جزاء مدني وجنائي"
        ],
        "answer": "جزاء مدني وجنائي"
    },
    {
        "text": "تختلف القاعدة الدينية عن القاعدة القانونية من حيث",
        "options": [
            "طبيعة الجزاء",
            "الجزاء",
            "العمومية والتجريد"
        ],
        "answer": "طبيعة الجزاء"
    },
    {
        "text": "لا يجوز تقديم النص القانونى على اتفاق الأشخاص فى القاعدة القانونية المكملة",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة صحيحة"
    },
    {
        "text": "تعد فكرة النظام العام فكرة ثابتة لا تتغير بتغير الزمان والمكان",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة خاطئة"
    },
    {
        "text": "من موضوعات القانون المالى",
        "options": [
            "بيان شكل الدولة",
            "بيان بتنظيم مالية الدولة وتحديد مواردها وسبل تحصيلها وأجه انفاقها",
            "تحديد الأفعال المجرمة قانوناً وعقوبتها"
        ],
        "answer": "بيان بتنظيم مالية الدولة وتحديد مواردها وسبل تحصيلها وأجه انفاقها"
    },
    {
        "text": "قانون العمل هو أحد فروع القانون العام المختص بتنظيم العلاقة بين العمال و أرباب الأعمال",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة خاطئة"
    },
    {
        "text": "الطبيب الذى لا يخبرمريضه بخطر حصول شلل له فى عصب الوجه نتيجة للعملية سيجرىها,لا يعد مقصراً على نحو يوجب مسئوليته",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة خاطئة"
    },
    {
        "text": "تعد القاعدة القانونية من قواعد القانون العام, إذا كانت الدولة أحد أطرافها طرفاً فى العلاقة القانونية التى تنظمها هذه القاعدة, وذلك وفقاً لـ",
        "options": [
            "معيار أطراف العلاقة",
            "معيار المصلحة",
            "معيارصفة أطراف العلاقة"
        ],
        "answer": "معيار أطراف العلاقة"
    },
    {
        "text": "يكون الاثبات فى المسائل................ بكافة الطرق أياً كانت قيمة المعاملة",
        "options": [
            "المدنية",
            "التجارية",
            "كلاهما"
        ],
        "answer": "التجارية"
    },
    {
        "text": "قد تكون النية سبباً لتشديد العقوبة على السلوك الاجرامي",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة صحيحة"
    },
    {
        "text": "تكون القاعدة القانونية متصلة بالصيغة اللازمية إذا كانت آمرة فقط",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة خاطئة"
    },
    {
        "text": "التزام المحامي في الدفاع عن موكله هو التزام بتحقيق غاية",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة خاطئة"
    },
    {
        "text": "النوايا والبواعث الداخلية التى لم تترجم إلى أقوال أو أفعال لا يحساب عليها القانون مهما بلغت درجة تجاوزها",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة صحيحة"
    },
    {
        "text": "يعد الجزاء المترتب على مخالفة قواعد القانون",
        "options": [
            "جزاء معنوي",
            "جزاء مادي",
            "لاشئ مما سبق"
        ],
        "answer": "جزاء مادي"
    },
    {
        "text": "حرية المريض في قبول العمل الطبى أو رفضه حرية مطلقةً",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة خاطئة"
    },
    {
        "text": "يشترط لإجراء التجارب الطبية على المرضى أن يكون رضائه حراً مستنيراً",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة صحيحة"
    },
    {
        "text": "التزام الطبيب بعلاج المريض",
        "options": [
            "التزام بتحقيق غاية",
            "التزام ببذل عناية",
            "إعطاء شئ"
        ],
        "answer": "التزام ببذل عناية"
    },
    {
        "text": "من صور الجزاء الجنائى",
        "options": [
            "البطلان",
            "التعويض",
            "الغرامة"
        ],
        "answer": "الغرامة"
    },
    {
        "text": "يقصد بـ...... إظهار بمواطن الأمور بكل صراحة ووضوح, للكشف عنها بلا مداراة أو صورية",
        "options": [
            "التزام بالصدق",
            "التزام بالشفافية",
            "التزام بالأمانة"
        ],
        "answer": "التزام بالشفافية"
    },
    {
        "text": "هى مجموعة من القواعد التى يجوز للأفراد الاتفاق على مخالفتها ولا يقع باطلاً كل اتفاق يخالف ذلك",
        "options": [
            "قواعد القانون العام",
            "القاعدة القانونية الآمرة",
            "القاعدة القانونية المكملة"
        ],
        "answer": "القاعدة القانونية المكملة"
    },
    {
        "text": "يقتصر تطبيق ......... على العاملين بالجهاز الإدارى للدولة",
        "options": [
            "الجزاء الإدارى",
            "الجزاء الجنائى",
            "الجزاء المدنى"
        ],
        "answer": "الجزاء الإدارى"
    },
    {
        "text": "يشترط على الطبيب أن يراعي عند وصفه أدويةً معينةً لمريضه مناسبتها للظروف الصحية والجسمانية لهذا المريض",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة صحيحة"
    },
    {
        "text": "لا يفترض التضامن بين المدينيين في المعاملات التجارية",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة خاطئة"
    },
    {
        "text": "لا ينتهي عقد المحامي مع موكله بموت أحدهما أو كليهما, بل ينتقل إلى الورثة",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة خاطئة"
    },
    {
        "text": "يلعب الالتزام بالإعلام قبل التعاقد دوراً مهماً في تحقيق التوازن بين الراغبين في التعاقد",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة صحيحة"
    },
    {
        "text": "ذلك العدل الذى يقرر لمصلحة الفرد فى مواجهة المجتمع",
        "options": [
            "العدل التبادلي",
            "العدل التوزيعي",
            "العدل الاجتماعي"
        ],
        "answer": "العدل التوزيعي"
    },
    {
        "text": "يعد القانون المدنى من فروع القانون الخاص",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة صحيحة"
    },
    {
        "text": "لا يجوز للمحامي الاتفاق مع موكله على إعفائه من المسئولية العقدية الناتجة عن عدم تنفيذ التزاماته في العقد إذا كان الخطأ",
        "options": [
            "جسيم",
            "عمدى",
            "كل ما سبق"
        ],
        "answer": "كل ما سبق"
    },
    {
        "text": "يسمى الجزاء الموقع من الأجهزة الإدارية العامة فى الدولة على العاملين لديها عند ارتكابهم لمخالفات إدارية بالجزاء السياسى",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة خاطئة"
    },
    {
        "text": "يسمح للطبيب بالتدخل العلاجي دون الحصول على موافقة المريض فى",
        "options": [
            "حالة المريض تقتضى التدخل السريع",
            "حالة التطعيم ضد الأمراض المعدية",
            "كلاهما"
        ],
        "answer": "كلاهما"
    },
    {
        "text": "هي الجرائم المعاقب عليها بالحبس مدة لا تقل عن 24 ساعة ولاتزيد عن ثلاث سنوات",
        "options": [
            "الجنح",
            "الجنايات",
            "المخالفات"
        ],
        "answer": "الجنح"
    },
    {
        "text": "تسمى القواعد التى تنظم شكل الدولة ونظام الحكم فيها بالقانون",
        "options": [
            "الدستوري",
            "الإداري",
            "المدنى"
        ],
        "answer": "الدستوري"
    },
    {
        "text": "يجوز الجمع بين المحاماة والعمل",
        "options": [
            "بالتجارة",
            "كرئيس مجلس إدارة شركة مساهمة",
            "كأستاذ قانون فى الجامعات المصرية"
        ],
        "answer": "كأستاذ قانون فى الجامعات المصرية"
    },
    {
        "text": "من مظاهر تقصير الطبيب فى أداء عمله",
        "options": [
            "أن يتغيب الطبيب المكلف من قبل رب العمل بالتواجد في ميدان العمل",
            "متابعة مريضه الذي بدأ معالجته ولم يزل خاضعاً تحت العلاج أو الجراحة",
            "ضمان سلامة المريض من الأدوات أو الأجهزة التى يستعملها"
        ],
        "answer": "أن يتغيب الطبيب المكلف من قبل رب العمل بالتواجد في ميدان العمل"
    },
    {
        "text": "قواعد القانون تنظم علاقة الإنسان",
        "options": [
            "مع نفسه ومع غيره",
            "مع ربه",
            "جميع ما سبق"
        ],
        "answer": "مع نفسه ومع غيره"
    },
    {
        "text": "يختص ................ بنظر المنازعات المدنية والتجارية",
        "options": [
            "القضاء العادى",
            "القضاء الإداري",
            "كلاهما"
        ],
        "answer": "القضاء العادى"
    },
    {
        "text": "المسئولية الناشئة عن الالتزام بالإعلام قبل التعاقد",
        "options": [
            "مسئولية عقدية",
            "مسئولية تقصيرية",
            "لا شئ مما سبق"
        ],
        "answer": "مسئولية تقصيرية"
    },
    {
        "text": "تعد قواعد قانون المرافعات من قبيل القواعد الموضوعية التى يستند إليها القاضى فى حل النزاعات",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة خاطئة"
    },
    {
        "text": "تعد عقوبة الخصم من الراتب من صور الجزاء",
        "options": [
            "الجنائى",
            "السياسي",
            "الإداري"
        ],
        "answer": "الإداري"
    },
    {
        "text": "يقع جزاء......................عند امتناع أحد أطراف العقد عن تنفيذ التزاماته",
        "options": [
            "فسخ العقد",
            "البطلان النسبى للعقد",
            "البطلان المطلق للعقد"
        ],
        "answer": "فسخ العقد"
    },
    {
        "text": "إذا قام الطبيبُ بقطع إصبع شخص بهدف إعانته على الإفلات من واجب أداء الخدمة العسكرية لا تنعقد بذلك مسئوليته القانونية",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة خاطئة"
    },
    {
        "text": "يعتبر بطلان العقد كجزاء لتخلف أحد أركانه جزاءً",
        "options": [
            "مدنياً",
            "جنائياً",
            "إدارياً"
        ],
        "answer": "مدنياً"
    },
    {
        "text": "لا تعتبر قواعد القانون المنظم لمنصب رئيس الجمهورية قواعد عامة مجردة نظراً لأنها تخاطب فرداً واحداً",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة خاطئة"
    },
    {
        "text": "القانون ليس وحده هو الذى ينفرد بتنظيم علاقات الأفراد",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة صحيحة"
    },
    {
        "text": "يسأل المهني عن أخطائه المهنية وفقاً لمعيار الشخص المحترف",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة خاطئة"
    },
    {
        "text": "يعد امتناع رجل الإسعاف طبيباً كان أو ممرضاً عن إسعاف المصابين في حوادث الطرق العامة ونقلهم إلى المستشفى خطأً تقصيرياً يستوجب مسئوليته",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة صحيحة"
    },
    {
        "text": "تعد الاستعانة بالمحامي في الجنايات أمراً جوازياً",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة خاطئة"
    },
    {
        "text": "لا يكون الطبيب مسئولاً قانونياً إذا نقل لمريضه دما ملوثاً من متبرع دون أن يتأكد من سلامة هذا الدم وخلوه من حمل أية أمراض معدية لمريضه",
        "options": [
            "العبارة صحيحة",
            "العبارة خاطئة"
        ],
        "answer": "العبارة خاطئة"
    }
]
            },
            { title: "Final 2024 - Computer & Ethics - Dr. Muhammed Abdel3leem",pdf:"qestions/final/2024/Final2024_CE_Dr_Muhammed_Abdel3leem.pdf",
            interactive: true, 

             questions: [
    {
        "text": "يتماثل الالتزام بالإعلام قبل التعاقد مع الالتزام بالعالم المصدر النشأة وقت الغاية",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "يمكن أن تتقدم أصحابها المهنة في غيبة ثقة أمانة لها المقررة والعقوبات",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "هو مجموعة القواعد الموضوعية التي تحدد الأفعال المجرمة قانوناً والعقوبات المقررة لها",
        "options": [
            "القانون الجنائي",
            "قانون الإجراءات الجنائية",
            "القانون الدولي"
        ],
        "answer": "القانون الجنائي"
    },
    {
        "text": "في القانون الديني لا يوجد جزاء واحد لها في الدنيا، بل جزاءان أحدهما في الدنيا والآخر في الآخرة، حين تخالف القواعد الدينية",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    },
    {
        "text": "هو البطلان الذي تقضي به المحكمة بنفسه دون طلب أحد الخصوم",
        "options": [
            "البطلان النسبي",
            "البطلان المطلق",
            "البطلان الجزئي"
        ],
        "answer": "البطلان المطلق"
    },
    {
        "text": "هي القواعد التي يجوز للأفراد الاتفاق على مخالفتها",
        "options": [
            "القواعد الآمرة",
            "القواعد المكملة",
            "القواعد التنظيمية"
        ],
        "answer": "القواعد المكملة"
    },
    {
        "text": "إن غاية القانون ليست غاية في ذاتها، بل هي وسيلة لحماية حقوق الأفراد وحرياتهم",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    },
    {
        "text": "تقوم المسؤولية المدنية والجنائية في حالات كلفة العدالة",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "إذا اتفق الطبيب مع زوجته مريضته أن يخبرها بعجزه عن إنجاب صالحة رغماً أنه ليس بعاجز",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "التي تقضى بأن ثمن المبيع يكون مستحق الوفاء في المكان والزمان الذي يُسلم فيه المبيع",
        "options": [
            "قاعدة قانونية آمرة",
            "قاعدة مكملة",
            "قاعدة غير قانونية"
        ],
        "answer": "قاعدة مكملة"
    },
    {
        "text": "يُخذ الجزاء في الدنيا جزاء دنيوي الكاذب في فقدان ثقة الناس",
        "options": [
            "العدل التبادلي",
            "العدل التوزيعي",
            "العدل الاجتماعي"
        ],
        "answer": "العدل التبادلي"
    },
    {
        "text": "يتخذ الجزاء الدنيوي صورة واحدة وهي فقدان ثقة الناس في الكاذب",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "ما يجب على الفرد في مواجهة غيره من الأفراد سواء في إطار العلاقات العقدية أو في إطار العلاقات الأخرى",
        "options": [
            "العدل التبادلي",
            "العدل التوزيعي",
            "العدل الاجتماعي"
        ],
        "answer": "العدل التبادلي"
    },
    {
        "text": "طبقاً لرأي الراجح يختلف مصطلح المعلومات من حيث الدلالة",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "يشترط على الطبيب أن يراعي عند وصفه أدوية معينة لمريضه مناسبتها للظروف الصحية والجسمانية لهذا المريض",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    },
    {
        "text": "لا ينتهي عقد المحامي مع موكله بموت أحدهما أو كليهما، بل ينتقل إلى الورثة",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "هو مجموعة القواعد التي تحدد شكل الدولة ونظام الحكم فيها",
        "options": [
            "القانون الدستوري",
            "القانون الجنائي",
            "القانون الدولي العام"
        ],
        "answer": "القانون الدستوري"
    },
    {
        "text": "إلى يستند المعيار الشكلي في التمييز بين القواعد الآمرة والمكملة",
        "options": [
            "معاني القانونية",
            "موضوع القانون",
            "النص القانوني"
        ],
        "answer": "النص القانوني"
    },
    {
        "text": "في حالة الخلال بالالتزام بالعالم قبل التعاقد تقوم المسؤولية العقدية في حق المخالف",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "هو الجزاء الذي يقع على نفسه الجاني وماله",
        "options": [
            "الجزاء الجنائي",
            "الجزاء المدني",
            "الجزاء الإداري"
        ],
        "answer": "الجزاء المدني"
    },
    {
        "text": "من صور الجزاء الإداري: اللوم، التعويض، التنفيذ العيني",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "من صور الجزاء المدني: الحبس، العدام، الفسخ",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "المشورة أن تشتمل بالضرورة على المعلومة ولكن العكس ليس صحيحاً",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    },
    {
        "text": "يقتصر تطبيق الجزاء الإداري على العاملين بالجهاز الإداري للدولة",
        "options": [
            "الجزاء الإداري",
            "الجزاء الجنائي",
            "الجزاء المدني"
        ],
        "answer": "الجزاء الإداري"
    },
    {
        "text": "ليست حرية المريض في قبول العمل الطبي أو رفضه حرية مطلقة",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    },
    {
        "text": "قواعد الدين ذات نطاق واسع لها قواعد القانون",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "غاية القانون واقعية بينما غاية الأخلاق مثالية",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    },
    {
        "text": "يقصد بـ........ إظهار بمواطن الأمور بكل صراحة ووضوح، للكشف عنها بلا مداراة أو صورية",
        "options": [
            "التزام بالصدق",
            "التزام بالشفافية",
            "التزام بالأمانة"
        ],
        "answer": "التزام بالشفافية"
    },
    {
        "text": "الالتزام بالإعلام قبل التعاقد أساسه ومصدرها القواعد العامة",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "يسمح للطبيب بالتدخل العلاجي دون الحصول على موافقة المريض في حالة المريض تقتضى التدخل السريع أو حالة التطعيم ضد الأمراض المعدية",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    },
    {
        "text": "الالتزام بالإعلام قبل التعاقد في حالة عدم الضرورة غير أخلاقية",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "هو مجموعة القواعد التي تنظم سلوك الأفراد داخل المجتمع بما يضمن سيره على سبيل الالتزام",
        "options": [
            "قواعد الأخلاق",
            "القانون",
            "العرف"
        ],
        "answer": "القانون"
    },
    {
        "text": "الغرامة التهديدية هي الغرامة التي يحكم على المدين بها كل وحده زمنية معينة يتقاعس فيها المدين عن تنفيذ التزامه",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    },
    {
        "text": "يجب على المهني التزام جانب التصارحة والمكاشفة في تعامله مع عملائه",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    },
    {
        "text": "العدل الاجتماعي يقتضي المساواة .............. بين أفراد المجتمع",
        "options": [
            "المطلقة",
            "النسبية",
            "لا توجد إجابة"
        ],
        "answer": "النسبية"
    },
    {
        "text": "هو مجموعة القواعد الموضوعية التي تنظم العلاقات القانونية التي تنشأ بين أشخاص القانون الخاص",
        "options": [
            "القانون المدني",
            "القانون الدستوري",
            "القانون العام"
        ],
        "answer": "القانون المدني"
    },
    {
        "text": "تتشابه قواعد الدين مع قواعد القانون من حيث المصدر",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "تنقسم الجرائم من حيث جسامتها إلى: خمسة أنواع",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "الالتزام التعاقدي هو ناتج العقد",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    },
    {
        "text": "من صور الأمانة وأشكال الصور بين الناس: حسن القضاء",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "يتوقف قيام السلطة المختصة في الدولة بتوقيع الجزاء على تقديم شكوى من المضرور في بعض الحوال",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "تعني الأمانة في اللغة الطمأنينة التي يوثق بها وجعله أميناً",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    },
    {
        "text": "يجب على كل المهنيين أن يتحلى بها أثناء ممارسته لعملهم: صفة الشفافية",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    },
    {
        "text": "قواعد ...... هي التي يحكم عليها المدين بها كل وحده زمنية معينة يتقاعس فيها المدين عن تنفيذ التزامه",
        "options": [
            "قواعد آمرة",
            "قواعد مكملة",
            "لا توجد إجابة"
        ],
        "answer": "قواعد مكملة"
    },
    {
        "text": "من شروط الجزاء في القاعدة القانونية: أن يكون الجزاء مادياً أو أن يكون غير مباشر",
        "options": [
            "لا توجد إجابة",
            "صح",
            "خطأ"
        ],
        "answer": "لا توجد إجابة"
    },
    {
        "text": "من مظاهر الخطأ الطبي: أن يجوز ممارسة العمل الطبي لمن كان مرخصاً له بالعمل الطبي إلا إذا كان مسؤولاً مباشراً أو غير مباشر",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "تتميز القاعدة القانونية بأنها قاعدة عامة مجردة",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "صح"
    },
    {
        "text": "الالتزام بالتحذير والالتزام بالحق في التعاقد",
        "options": [
            "صح",
            "خطأ"
        ],
        "answer": "خطأ"
    },
    {
        "text": "هو مجموعة القواعد المنظمة لنشاط السلطة القضائية حيث تحديد درجات المحاكم وتشكيلها",
        "options": [
            "قانون العمل",
            "القانون الدولي الخاص",
            "القانون المدني"
        ],
        "answer": "القانون الدولي الخاص"
    },
    {
        "text": "يعد القانون ............................... أحد فروع القانون الخاص",
        "options": [
            "القانون التجاري",
            "القانون الجنائي",
            "القانون الإداري"
        ],
        "answer": "القانون التجاري"
    }
]

           },
            { 
                title: "Final 2025 - National - Dr. Muhammed Abdel3leem", pdf:"qestions/final/2025/Final2025_National_Dr_Muhammed_Abdel3leem.pdf" ,
                interactive: true, 
                questions: [
                    { text: "يستمد الالتزام بالإعلام قبل التعاقد مصدره من:", options: ["العرف", "المعاهدات الدولية", "المبادئ العامة للقانون"], answer: "العرف" },
                    { text: "يرى البعض من الفقه أن الواجب له دائماً أصل تشريعي.", options: ["صح", "خطأ"], answer: "خطأ" },
                    { text: "يعد الالتزام بالتحذير التزاما مستقلا من الالتزام بالإعلام قبل التعاقد.", options: ["صح", "خطأ"], answer: "صح" },
                    { text: "يتشابه الالتزام التعاقدي بالإعلام مع الالتزام بالإعلام قبل التعاقد من حيث:", options: ["الغاية", "المصدر", "وقت النشأة"], answer: "الغاية" },
                    { text: "طبقا للرأي الراجح يختلف مصطلح الاعلام و المعلومات من حيث الدلالة.", options: ["صح", "خطأ"], answer: "صح" },
                    { text: "الأمانة في اللغة تعني الاطمئنان اليه والوثوق فيه وجعله أمينا عليه.", options: ["صح", "خطأ"], answer: "صح" },
                    { text: "من وظائف القانون تحقيق العدل فقط داخل المجتمع.", options: ["صح", "خطأ"], answer: "خطأ" },
                    { text: "الكذب من السلوكيات الإنسانية المحدودة الآثار والمقصورة على فاعليها.", options: ["صح", "خطأ"], answer: "خطأ" },
                    { text: "لا يكفي أن يكون المهني صادقاً غير كاذب ، بل لابد أيضاً أن يكون صريحاً لا يداري عن عميله شيئاً يهمه معرفته.", options: ["صح", "خطأ"], answer: "صح" },
                    { text: "تعد فكرة النظام العام فكرة مرنة تتغير بتغير الزمان والمكان.", options: ["صح", "خطأ"], answer: "صح" },
                    { text: "مجموعة القواعد الموضوعية التي تحدد الأفعال التي تعد جرائم قانونا والعقوبات المقررة لها:", options: ["القانون المدني", "القانون الدولى", "القانون الجنائي"], answer: "القانون الجنائي" },
                    { text: "يختلف الالتزام بالإعلام قبل التعاقد عن الالتزام التعاقدي بالإعلام من حيث المصدر.", options: ["صح", "خطأ"], answer: "صح" },
                    { text: "الجزاء ليس عنصراً من عناصر القاعدة القانونية.", options: ["صح", "خطأ"], answer: "خطأ" },
                    { text: "يجوز الاتفاق على مخالفة القاعدة الآمرة.", options: ["صح", "خطأ"], answer: "خطأ" },
                    { text: "تتفق القاعدة القانونية مع القاعدة الإخلاقية من حيث طبيعة الجزاء والنطاق.", options: ["صح", "خطأ"], answer: "خطأ" },
                    { text: "العدل التبادلي هو ما يجب على الفرد في مواجهة غيره من الأفراد سواء في إطار العلاقات العقدية أم في إطار العلاقات الأخرى.", options: ["صح", "خطأ"], answer: "صح" },
                    { text: "يختص القانون الدولي الخاص بتنظيم العلاقات الخاصة المتضمنة عنصر وطني.", options: ["صح", "خطأ"], answer: "خطأ" },
                    { text: "طبقا للرأي الراجح في الفقه ، يأخذ بمعيار ................ للتفرقة بين القانون العام والقانون الخاص.", options: ["اطراف العلاقة", "صفة الاطراف", "المصلحة"], answer: "المصلحة" },
                    { text: "لايعد القانون غاية فى حد ذاته، إنما هو وسيلة يقصد من ورائها حماية حقوق الأفراد دون حرياتهم.", options: ["صح", "خطأ"], answer: "خطأ" },
                    { text: "يقتصر تطبيق الجزاء الإداري علي العاملين بالجهاز الإداري للدولة.", options: ["صح", "خطأ"], answer: "خطأ" },
                    { text: "القانون الذي يصلح في مجتمع معين يصلح بالضرورة في غيرة من المجتمعات.", options: ["صح", "خطأ"], answer: "خطأ" },
                    { text: "يحقق العدل التبادلي المساواة المطلقة بين أفراد المجتمع.", options: ["صح", "خطأ"], answer: "خطأ" },
                    { text: "المشورة توجب علي مقدمها بذل العناية الطبيعية أو العادية في تزويد عملائه بالمعلومات الفنية.", options: ["صح", "خطأ"], answer: "صح" },
                    { text: "تتولي السلطة الحاكمة تنظيم حقوق الافراد وحرياتهم داخل المجتمع.", options: ["صح", "خطأ"], answer: "صح" },
                    { text: "تتميز قواعد القانون وقواعد الأخلاق بانها قواعد ملزمة.", options: ["صح", "خطأ"], answer: "صح" },
                    { text: "من صور الأمانة رعاية ولي الأسرة لأسرته من زوجة وأولاد ووالدين وصلة أرحام.", options: ["صح", "خطأ"], answer: "صح" },
                    { text: "الغرامة التهديدية هي الغرامة التي يحكم بها علي المدين عن كل وحده زمنية معينة يتقاعس فيها المدين عن تنفيذ التزامه.", options: ["صح", "خطأ"], answer: "صح" },
                    { text: "المسئولية الناشئة عن الالتزام بالإعلام قبل التعاقد مسئوليه تقصيرية.", options: ["صح", "خطأ"], answer: "صح" },
                    { text: "من صور الجزاء المدني البطلان.", options: ["صح", "خطأ"], answer: "صح" },
                    { text: "الالتزام التعاقدي بالإعلام يجد أساسه ومصدره في العقد.", options: ["صح", "خطأ"], answer: "صح" },
                    { text: "القانون الدولى العام هو القانون الذي يحدد نظام الحكم فى الدولة.", options: ["صح", "خطأ"], answer: "خطأ" },
                    { text: "تعد القاعدة القانونية قاعدة:", options: ["تقويمية", "اختيارية", "تقريرية"], answer: "تقويمية" },
                    { text: "للاعتراف بالالتزام بالإعلام قبل التعاقد ضرورة أخلاقية لكنه يفتقد للضرورة العملية.", options: ["صح", "خطأ"], answer: "خطأ" },
                    { text: "............. يعني الثبات الذي يحفظ للمجتمع بنيانه ويجنيه عوامل الهدم و الفوضي.", options: ["الامن", "الاستقرار", "العدل"], answer: "الاستقرار" },
                    { text: "يجوز أن تخاطب القاعدة القانونية شخصا واحدا فقط أو فئة معينة من الأشخاص.", options: ["صح", "خطأ"], answer: "خطأ" },
                    { text: "حرية المريض في قبول العمل الطبى أو رفضه ليست حريةً مطلقةً.", options: ["صح", "خطأ"], answer: "صح" },
                    { text: "يلعب الالتزام بالإعلام قبل التعاقد دوراً مهماً في تحقيق التوازن بين الراغبين في التعاقد.", options: ["صح", "خطأ"], answer: "صح" },
                    { text: "تعتبر الغاية التي يهدف القانون إلى تحقيقها غاية نفعية بحتة.", options: ["صح", "خطأ"], answer: "صح" },
                    { text: "يتخذ الجزاء الدنيوي للكذب صوراً كثيرة منها:", options: ["فقدان ثقة الناس", "زيادة الارزاق", "النفاق"], answer: "فقدان ثقة الناس" },
                    { text: "تعد كل مشورة معلومة وليس كل معلومة مشورة.", options: ["صح", "خطأ"], answer: "صح" },
                    { text: "........... هو مجموعة القواعد المنظمة لنشاط السلطة القضائية سواء من حيث تحديد درجات المحاكم وتشكيلها واختصاصها.", options: ["القانون المدني", "قانون المرافعات", "القانون الاداري"], answer: "قانون المرافعات" },
                    { text: "القواعد التي لا يجوز للإفراد الاتفاق على مخالفتها هي:", options: ["القواعد الآمرة", "القواعد المكملة", "العدالة التوزيعية"], answer: "القواعد الآمرة" },
                    { text: "........... هو ذلك العدل الذي يقرر لمصلحة الفرد في مواجهة المجتمع.", options: ["العدل التوفيقي", "العدل التوزيعي", "العدل التبادلي"], answer: "العدل التوزيعي" },
                    { text: "........... هو الجزاء الذي يقع علي نفس الجاني او جسمه او ماله.", options: ["الجزاء المدني", "الجزاء الجنائي", "الجزاء الاداري"], answer: "الجزاء الجنائي" },
                    { text: "من صور الامانة فى المعاملات:", options: ["الصدق فى البيع والشراء", "حسن القضاء بين الناس", "جميع ما سبق"], answer: "جميع ما سبق" },
                    { text: "........... هو البطلان الذي تقضي به المحكمة من تلقاء نفسها دون ان يتوقف علي طلب الخصوم.", options: ["البطلان المطلق", "البطلان النسبي", "البطلان شبه المطلق"], answer: "البطلان المطلق" },
                    { text: "يعد من الاهداف الجوهرية للقاعدة القانونية تحقيق:", options: ["الامن", "العدالة", "جميع ما سبق"], answer: "جميع ما سبق" },
                    { text: "تتميز قواعد الدين بانها:", options: ["قواعد عامة مجردة", "قواعد عامة غير ملزمة", "قواعد عامة غير مجردة"], answer: "قواعد عامة مجردة" },
                    { text: "الشفافية صفة يجب ان يتحلى بها بعض المهنيين دون البعض.", options: ["صح", "خطأ"], answer: "خطأ" },
                    { text: "العدل الاجتماعي يقتضي المساواة .............. بين افراد المجتمع.", options: ["المطلقة", "النسبية", "التوزيعية المطلقة"], answer: "النسبية" }
                ]
            }
        ];

        // ==========================================
        // 4. قاعدة بيانات نماذج الامتحانات (Exam Models)
        // ==========================================
        
        var examModels = [
            { 
                title: "Exam Model 1 - Computer & Ethics",pdf:"qestions/Exam_Model/Exam_Model_1_Solutions_Computer_Ethics.pdf" , 
                interactive: true,
                questions: [{"text": "تخاطب القاعدة القانونية سلوك الفرد دوماً ولا تطرق مطلقاً إلى نواياه.", "options": ["صح", "خطأ"], "answer": "صح"},
                    {"text": "الأصل أن ينصاع الفرد المخاطب بالقاعدة القانونية لمضمونها إرادته واختياره.", "options": ["صح", "خطأ"], "answer": "صح"},
                    {"text": "إذا نوى شخص قتل آخر ثم عدل عن نيته تلك دون أن يرتكب هذا السلوك الإجرامي فلا يعاقبته قانوناً.", "options": ["صح", "خطأ"], "answer": "صح"},
                    {"text": "تخاطب القاعدة القانونية جميع أفراد المجتمع بأسمائهم وذواتهم.", "options": ["صح", "خطأ"], "answer": "خطأ"},
                    {"text": "لا يمكن وصف قواعد قانون تنظيم المهن الطبية بأنها قواعد عامة مجردة نظراً لتخصصها في مجال واحد.", "options": ["صح", "خطأ"], "answer": "خطأ"},
                    {"text": "أن يتم تحديد مدة زمنية مؤقتة لسريان القاعدة القانونية فإن ذلك ينفي عنها وصف العمومية والتجريد.", "options": ["صح", "خطأ"], "answer": "خطأ"},
                    {"text": "تعتبر قواعد القانون المنظم لمنصب رئيس الجمهورية قواعد عامة مجردة رغم كونها تخاطب فرداً واحداً.", "options": ["صح", "خطأ"], "answer": "صح"},
                    {"text": "القواعد المكملة هي التي يجب على الأفراد الالتزام بأحكامها دون أن يسمح لهم بالاتفاق فيما بينهم على مخالفتها.", "options": ["صح", "خطأ"], "answer": "خطأ"},
                    {"text": "لا يمكن أن تكون القاعدة القانونية ملزمة ما لم تقترن بجزاء.", "options": ["صح", "خطأ"], "answer": "صح"},
                    {"text": "تختلف قواعد الأخلاق وقواعد المجاملة الاجتماعية من زمن لآخر ومن مكان لآخر.", "options": ["صح", "خطأ"], "answer": "صح"},
                    {"text": "تهدف كل من قواعد القانون والدين والأخلاق ذات الغاية.", "options": ["صح", "خطأ"], "answer": "خطأ"},
                    {"text": "يمكن وصف قواعد الدين وقواعد الأخلاق بكونها عامة مجردة.", "options": ["صح", "خطأ"], "answer": "صح"},
                    {"text": "يطبق الجزاء الإداري كعقوبة لمخالفة قاعدة قانونية تحمي مصلحة خاصة.", "options": ["صح", "خطأ"], "answer": "خطأ"},
                    {"text": "لا يجوز مطلقاً لشخص غير مصري مزاولة مهنة الطب البشري في مصر.", "options": ["صح", "خطأ"], "answer": "خطأ"},
                    {"text": "لا يكون الطبيب مسؤولاً بشكل قانوني إذا لم يرض المريض بالعلاج فتركه الطبيب دون محاولة إثنائه عن رأيه.", "options": ["صح", "خطأ"], "answer": "خطأ"},
                    {"text": "للوالدين الحق الكامل في تقرير قبول العلاج أو رفضه نيابة عن أبنائهم.", "options": ["صح", "خطأ"], "answer": "خطأ"},
                    {"text": "يجوز للصيدلي القيام ببعض الممارسات الطبية مثل إعطاء الحقن، باعتبارها من صميم عمله.", "options": ["صح", "خطأ"], "answer": "خطأ"},
                    {"text": "يلتزم الطبيب بمراعاة الأصول الفنية لمهنة الطب حتى وإن لم تتمتع بالثبات والاستقرار.", "options": ["صح", "خطأ"], "answer": "خطأ"},
                    {"text": "لا يكون الطبيب مخالفاً لأصول مهنته إذا ما وصف لمريضه علاجاً غير مرخص من الجهة المختصة.", "options": ["صح", "خطأ"], "answer": "خطأ"},
                    {"text": "لا يلتزم الطبيب بالحصول على موافقة المريض إذا كان يحتاج إلى تدخل جراحي عاجل.", "options": ["صح", "خطأ"], "answer": "خطأ"},
                    {"text": "يهدف القانون في الأساس إلى:", "options": ["أ- تحقيق الأمن", "ب- تحقيق الاستقرار", "ج- تحقيق العدل", "د- كل ما سبق"], "answer": "د- كل ما سبق"},
                    {"text": "يهدف الجزاء القانوني إلى:", "options": ["أ- الردع العام", "ب- الردع الخاص", "ج- عقاب مخالف القاعدة", "د- كل ما سبق"], "answer": "د- كل ما سبق"},
                    {"text": "كان نظام القضاء الخاص الذي يضطلع به الفرد المعتدى عليه شائعاً في:", "options": ["أ- المجتمعات الحديثة", "ب- المجتمعات القديمة", "ج- المجتمعات الحديثة والقديمة", "د- لم يكن مطبقاً في أي وقت"], "answer": "ب- المجتمعات القديمة"},
                    {"text": "يطلق على القواعد التي تنظم كل ما يتعلق بالمنظمات الدولية كمنظمة الأمم المتحدة القانون:", "options": ["أ- القانون الدولي العام", "ب- القانون العام", "ج- القانون الدولي الخاص", "د- القانون الدستوري"], "answer": "أ- القانون الدولي العام"},
                    {"text": "يعتبر من صور الجزاء المدني:", "options": ["أ- الغرامة", "ب- البطلان", "ج- السجن", "د- كل ما سبق"], "answer": "ب- البطلان"},
                    {"text": "من عقوبات الجنحة:", "options": ["أ- السجن المؤبد", "ب- الإعدام", "ج- الحبس", "د- السجن"], "answer": "ج- الحبس"},
                    {"text": "تعنى قواعد الأخلاق:", "options": ["أ- السلوك الداخلي للفرد", "ب- السلوك الخارجي للفرد", "ج- السلوك الداخلي والخارجي", "د- لا شيء مما سبق"], "answer": "ج- السلوك الداخلي والخارجي"},
                    {"text": "تنحصر معايير التفرقة بين القواعد الآمرة والقواعد المكملة في:", "options": ["أ- المعيار الشكلي", "ب- النظام العام", "ج- الآداب العامة", "د- كل ما سبق"], "answer": "د- كل ما سبق"},
                    {"text": "تنص المادة (48) من القانون المدني المصري على أن \"ليس أحد نزول عن أهليته أو التعديل في هذه المادة\" تعد:", "options": ["أ- قاعدة قانونية آمرة", "ب- قاعدة قانونية مكملة", "ج- ليست بقاعدة قانونية", "د- الشيء مما سبق"], "answer": "أ- قاعدة قانونية آمرة"},
                    {"text": "تنص المادة (136) من القانون المدني المصري على أن \"إذا لم يكن للالتزام سبب أو كان سببه مخالفاً للقانون كان العقد باطلاً\"؛ تتضمن هذه المادة قاعدة قانونية ملزمة وفقاً لـ:", "options": ["أ- المعيار الشكلي", "ب- المعيار الموضوعي", "ج- المعيار الشكلي والموضوعي", "د- الشيء مما سبق"], "answer": "ب- المعيار الموضوعي"},
                    {"text": "تسمى مجموعة القواعد الموضوعية التي تحدد الأفعال المجرمة قانوناً وعقوباتها والإجراءات المتبعة للمعاقبة عليها بـ:", "options": ["أ- القانون الإداري", "ب- القانون المدني", "ج- القانون الدولي الخاص", "د- القانون الجنائي"], "answer": "د- القانون الجنائي"},
                    {"text": "يختص بتوقيع الجزاء على من يخالف القاعدة القانونية:", "options": ["أ- أي فرد من المجتمع", "ب- السلطات العامة للدولة", "ج- المضرور من المخالفة", "د- ب وج"], "answer": "ب- السلطات العامة للدولة"},
                    {"text": "يجب على الطبيب مراعاة تطبيق الأصول الفنية لمهنته في مرحلة:", "options": ["أ- مرحلة التشخيص", "ب- مرحلة العلاج", "ج- مرحلة التدخل الجراحي", "د- كل ما سبق"], "answer": "د- كل ما سبق"},
                    {"text": "يشترط في من يمارس مهنة الطب البشري في مصر أن يكون:", "options": ["أ- مصري الجنسية", "ب- حاصل على المؤهل العلمي", "ج- مقيد لدى نقابة الأطباء", "د- مقيد لدى وزارة الصحة المصرية"], "answer": "ج- مقيد لدى نقابة الأطباء"},
                    {"text": "يمكن للطبيب ألا ينتظر موافقة المريض لقيام بمهمته الطبية وذلك إذا:", "options": ["أ- إذا كانت الحالة الصحية للمريض لا تسمح", "ب- إذا كان المريض منعدم الأهلية", "ج- حالة العلاج الإجباري", "د- لا شيء مما سبق"], "answer": "ج- حالة العلاج الإجباري"},
                    {"text": "التزام الطبيب بعلاج المريض من حيث التشخيص والعلاج والتدخل بجميع صوره هو التزام بـ:", "options": ["أ- بتحقيق نتيجة", "ب- ببذل عناية", "ج- ليس بالتزام قانوني", "د- لا شيء مما سبق"], "answer": "ب- ببذل عناية"}
                ]
            },
            { 
                title: "Exam Model 2 - Computer & Ethics", pdf:"qestions/Exam_Model/Exam_Model_2_Computer_Ethics.pdf" ,
                interactive: true,
                questions:
             [
  {
    "text": "القانون غاية في حد ذاته، إنما هو وسيلة يقصد من ورائها حماية حقوق الأفراد وحرياتهم",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "النوايا والبواعث الداخلية التي لم تترجم إلى أقوال أو أفعال لا يحاسب عليها القانون مهما بلغت درجة تجاوزها",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "للفرد المُخاطب بالقاعدة القانونية مطلق الحرية بين تطبيقها أو عدم تطبيقها",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "القاعدة القانونية تنشأ لتطبق على واقعة معينة ثم ينتهى دورها",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "يجوز أن تخاطب القاعدة القانونية شخصاً واحداً فقط أو فئة معينة من الأشخاص",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "لا تعتبر قواعد القانون المنظم لمنصب رئيس الجمهورية قواعد عامة مجردة نظراً لأنها تخاطب فرداً واحداً",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "الجزاء ليس عنصراً من عناصر القاعدة القانونية",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "يعتبر الأمر الصادر بمنح شخص معين جنسية معينة قاعدة قانونية",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "القانون ليس وحده هو الذي ينفرد بتنظيم علاقات الأفراد",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "يحق لأي فرد من أفراد المجتمع أن يوقع الجزاء بنفسه",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "نطاق القاعدة القانونية أضيق من نطاق القاعدة الدينية",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "جزاء مخالفة قواعد العادات والمجاملات جزاء مادي توقعه السلطة العامة",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "تتفق القاعدة القانونية مع القاعدة الأخلاقية من حيث طبيعة الجزاء والنطاق",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "القاعدة القانونية دون جزاء هي والعدم سواء",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "يجوز التصرف في الأموال المملوكة للدولة ملكية عامة",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "تعد قواعد قانون المرافعات من قبيل القواعد الموضوعية التي يستند إليها القاضي في حل النزاعات",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "يعد القانون الإداري من فروع القانون الخاص",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "من موضوعات القانون المدني بيان شكل الدولة ونظام الحكم فيها",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "غاية القانون واقعية بينما غاية الأخلاق مثالية",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "يعد القانون الدولي الخاص من فروع القانون العام الداخلي",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "يجوز الاتفاق على مخالفة القاعدة الآمرة",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "لا يجوز ممارسة العمل الطبي إلا لمن كان مرخصاً له قانوناً في مباشرته وإلا كان مسؤولاً جنائياً ومدنياً عن ذلك حتى وإن خالف سلوكه من أى مظهر من مظاهر الخطأ الطبي",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "النص القانوني يقدم على اتفاق الأشخاص في القاعدة القانونية المكملة",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "يختلف الالتزام بالإعلام قبل التعاقد عن الالتزام التعاقدي بالإعلام من حيث المصدر",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "تكون القاعدة القانونية متصلة بالصيغة الإلزامية إذا كانت آمرة فقط",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "المعيار اللفظي هو المعيار الوحيد للتفرقة بين القواعد الآمرة والمكملة",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "يشترط تطبيق الجزاء على الأفراد حتى تتحقق صفة الإلزام للقاعدة القانونية",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "لا يجوز كأصل عام المساس بجسم المريض إلا بعد الحصول على إذنه",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "لا يشترط على الطبيب أن يراعي عند وصفه أدوية معينة لمريضه مناسبتها للظروف الصحية والجسمانية لهذا المريض",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "يجب على الطبيب أثناء فحصه للمريض أن يوجه إليه جميع الأسئلة التي تعينه على الوقوف على حالته الصحية",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "يكون الطبيب مسؤولاً قانونياً إذا نقل لمريضه دماً ملوثاً من متبرع دون أن يتأكد من سلامة هذا الدم وخلوه من حمل أية أمراض معدية لمريضه",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "من حق الطبيب المعالج أن يحل محله طبيب آخر لإجراء عملية جراحية للمريض دون سبق الحصول على إذن المريض بذلك",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "الطبيب الذي لا يخبر مريضه بخطر حدوث شلل له في عصب الوجه نتيجة للعملية، سيجريها يكون مقصراً على نحو يوجب مسؤوليته",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "يشترط على الطبيب عند تعدد الوسائل المعتمدة في العلاج أو الجراحة أن يأخذ بما يتبعه غالبية الأطباء في هذا الشأن",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "حرية المريض في قبول العمل الطبي أو رفضه ليست حرية مطلقة",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "إذا قام الطبيب بقطع إصبع شخص بهدف إعانته على الإفلات من أداء الخدمة العسكرية انعقدت بذلك مسؤوليته القانونية",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "يسأل المهني عن أخطائه المهنية وفق المعيار الشخص المعتاد",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "يكون الطبيب قد أوفى بتنفيذ التزامه بمعالجة مريضه مجرد وصف الدواء أو إجراء العملية الجراحية له",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "يلتزم الطبيب بضمان سلامة المريض من الأدوات أو الأجهزة التي يستعملها",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "يعد امتناع رجل الإسعاف طبيباً كان أو ممرضاً عن إسعاف المصابين في حوادث الطرق العامة ونقلهم إلى المستشفى خطأ تقصيرياً يستوجب مسؤوليته",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "يشترط لإجراء التجارب الطبية على المرضى أن يكون رضاء المريض رضاءً حراً مستنيراً",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "يشترط لإجراء العمليات الجراحية أن يصدر الرضاء في شكل معين كإقرار كتابي",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "يجب على القاضي أن يحكم في القضايا بين الخصوم بكل حيدة وتجرد وفقاً للأحكام القانون",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "تكون الاستعانة بالمحامي في الجنايات أمراً إجبارياً",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "التزام المحامي في الدفاع عن موكله هو التزام ببذل عناية",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "لا يجوز للمحامي الاتفاق مع موكله على إعفائه من المسؤولية العقدية الناتجة عن عدم تنفيذ التزاماته في العقد",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "ينتهي عقد المحامي مع موكله بموت أحدهما أو كليهما، ولا ينتقل إلى الورثة",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "تكون مسؤولية الورثة عند وفاة مورثهم في حدود عناصر التركة فقط",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "يسمى الجزاء التي توقعها أو تباشرها الأجهزة الإدارية العامة في الدولة على العاملين لديها عند ارتكابهم لمخالفات إدارية بالجزاء المدني",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "يقترن القانون الدولي العام بجزاءات رادعة توقع على المخالف",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "القانون المالي هو أحد فروع القانون الخاص المعني بتنظيم مالية الدولة وتحديد مواردها وسبل تحصيلها وأجهزة إنفاقها",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "يعد التضامن بين المدينين مفترضاً في المعاملات التجارية",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "قانون العمل هو أحد فروع القانون العام المختص بتنظيم العلاقة بين العمال وأرباب الأعمال",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "يختص القانون الدولي الخاص بتنظيم العلاقات الخاصة المتضمنة عنصراً أجنبياً",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "القاعدة القانونية التي تقضي بتحمل المشترى في عقد البيع رسوم الدمغة والتسجيل تعد قاعدة آمرة",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "تعد فكرة النظام العام فكرة مرنة تتغير بتغير الزمان والمكان",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "طبقاً للرأي الراجح يختلف مصطلحا العلم والمعلومات من حيث الدلالة",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "تعد كل مشورة معلومة وليس كل معلومة مشورة",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "يعد الالتزام بالتحذير التزاماً مستقلاً من الالتزام بالإعلام قبل التعاقد",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "المسؤولية الناشئة عن الالتزام بالإعلام قبل التعاقد مسؤولية تقصيرية",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "قد يمتد أثر القانون لأفراد غير مخاطبين بأحكامه",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "يسأل المهني عن أخطائه المهنية وفق المعيار الشخص المعتاد",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "يستطيع الإنسان العيش بمعزل عن بني جنسه",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "القانون ليس غاية في حد ذاته، إنما وسيلة لحماية حقوق الأفراد وحرياتهم",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "تتولى السلطة الحاكمة تنظيم حقوق الأفراد وحرياتهم داخل المجتمع",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "يقصد بالقانون في معناه الواسع مجموعة القواعد القانونية التي تنظم سلوك الأفراد في مجتمع معين وبلد معين",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "أغفل المشرع تقرير حماية قانونية عليا للأوضاع الظاهرة وقصرها على الأوضاع الحقيقة",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "يتصور أن يأتي التكليف بمقتضى قاعدة قانونية غير مباشرة",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "لا يحاسب القانون على النوايا والبواعث الداخلية",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "قد تكون النية سبباً للتشديد العقوبة على السلوك الجرمي",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "لا تعد القواعد التي تنظم المركز القانوني لوزير المالية قواعد قانونية، لأنها تخاطب شخصاً واحداً فقط",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "القانون الذي يصلح في مجتمع معين يصلح بالضرورة في غيره من المجتمعات",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "لا يلزم أن تقترب القاعدة القانونية بجزاء مادي اعتقد الناس بضرورته للحفظ النظام العام",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "يتوقف قيام السلطة المختصة في الدولة بتوقيع الجزاء على تقديم شكوى من المضرور في بعض الأحوال",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "الغرامة التهديدية هي الغرامة التي يحكم بها على المدين عن كل وحدة زمنية معينة يتقاعس فيها المدين عن تنفيذ التزامه",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "قد ينتج جزاء مدني وجزاء جنائي عن ذات السلوك الجرمي",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "يقتصر تطبيق الجزاء الإداري على العاملين بالجهاز الإداري للدولة",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "تتماثل قواعد الدين وقواعد القانون من حيث الغرض",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "القانون ليس غاية في حد ذاته إنما هو وسيلة",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "يتماثل الجزاء الديني مع الجزاء القانوني من حيث المدى والنطاق",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "تتميز كلا من القواعد القانونية وقواعد الأخلاق بالتحديد والوضوح",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "يتسم المذهب الفردي بأنه يغالي في دور الأفراد على حساب المصلحة العامة للدولة",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "يتسم المذهب الفردي بقلة القواعد القانونية المكملة وكثرة القواعد الآمرة",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "طبقاً للمذهب الفردي تقوم المسؤولية المدنية على فكرة الضمان",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "السياسيات التي تتبعها الدول المعتنقة للمذهب الاشتراكي واحدة في كافة تلك الدول",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "تمنح الدول المعتنقة للمذهب الاشتراكي قدراً كبيراً من الحرية للأفراد في مباشرة النشاط الاقتصادي",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "يعد تبني المشرع المصري لمبدأ عدم التعسف في استعمال الحق مثالاً حياً على اعتناقه للمذهب الفردي",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "تتسم كافة قواعد القانون العام بأنها قواعد آمرة",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "تمتلك الدولة بإرادتها المنفردة تعديل شروط العقد الملزم للطرفين",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "لا يرد الحجز والتصرف والتملك بالتقادم على الأموال العامة",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "text": "الدساتير الجامدة هي الدساتير التي يمكن تعديلها بسهولة عن طريق التشريع العادي",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "خطأ"
  },
  {
    "text": "من صور الجزاء الجنائي .................",
    "options": [
      "البطلان",
      "الغرامة",
      "التعويض"
    ],
    "answer": "الغرامة"
  },
  {
    "text": "أقوى قواعد القانون من حيث الجزاء .................",
    "options": [
      "القانون المالي",
      "القانون الجنائي",
      "القانون الإداري"
    ],
    "answer": "القانون الجنائي"
  },
  {
    "text": "قواعد القانون تنظم علاقة الإنسان .............",
    "options": [
      "مع نفسه ومع غيره",
      "مع ربه",
      "جميع ما سبق"
    ],
    "answer": "مع نفسه ومع غيره"
  },
  {
    "text": "تعتبر الغاية التي يهدف القانون إلى تحقيقها والتي تميزه عن قواعد .............. الدين",
    "options": [
      "غاية مثالية",
      "غاية نفعية بحتة",
      "غاية أخلاقية"
    ],
    "answer": "غاية نفعية بحتة"
  },
  {
    "text": "تعد القاعدة القانونية من قواعد القانون العام، إذا كانت الدولة أحد أطرافها طرفاً في العلاقة القانونية التي تنظمها هذه القاعدة، وذلك وفقاً للــ..........",
    "options": [
      "معيار صفة أطراف العلاقة",
      "معيار المصلحة",
      "معيار أطراف العلاقة"
    ],
    "answer": "معيار صفة أطراف العلاقة"
  },
  {
    "text": "تختلف القاعدة الدينية عن القاعدة القانونية من ............... حيث",
    "options": [
      "طبيعة الجزاء",
      "الجزاء",
      "العمومية والتجريد"
    ],
    "answer": "طبيعة الجزاء"
  },
  {
    "text": "تختلف القاعدة القانونية مع قواعد الأخلاق من حيث .............. كل",
    "options": [
      "الغاية أو الهدف",
      "الجزاء",
      "العمومية والتجريد"
    ],
    "answer": "الغاية أو الهدف"
  },
  {
    "text": "يعتبر بطلان العقد كجزاء لتخلف أحد أركانه. جزاء...........",
    "options": [
      "مدنياً",
      "جنائياً",
      "إدارياً"
    ],
    "answer": "مدنياً"
  },
  {
    "text": ".............. هي مجموعة من القواعد التي لا يجوز للأفراد الاتفاق على مخالفتها ويقع باطلاً كل اتفاق يخالف ذلك",
    "options": [
      "قواعد القانون العام",
      "القاعدة القانونية الآمرة",
      "القاعدة القانونية المكملة"
    ],
    "answer": "القاعدة القانونية الآمرة"
  },
  {
    "text": "كل مما يلي من فروع القانون الخاص ما عدا..............",
    "options": [
      "القانون المدني",
      "القانون البحري",
      "القانون الإداري"
    ],
    "answer": "القانون الإداري"
  },
  {
    "text": "تسمى القواعد التي تنظم شكل الدولة ونظام الحكم فيها بالقانون ...........",
    "options": [
      "الدستوري",
      "الإداري",
      "المدني"
    ],
    "answer": "الدستوري"
  },
  {
    "text": "........... هو عبارة عن مجموعة القواعد القانونية التي تنظم العلاقة بين العمال وأصحاب العمل.",
    "options": [
      "قانون العمل",
      "القانون البحري",
      "القانون الجنائي"
    ],
    "answer": "قانون العمل"
  },
  {
    "text": "يختص ................. بنظر المنازعات المدنية والتجارية",
    "options": [
      "القضاء العادي",
      "القضاء الإداري",
      "كلاهما"
    ],
    "answer": "القضاء العادي"
  },
  {
    "text": "من موضوعات القانون الجنائي .............",
    "options": [
      "بيان شكل الدولة",
      "بيان التنظيم الداخلي للسلطة التنفيذية",
      "تحديد الأفعال المجرمة قانوناً وعقوبتها"
    ],
    "answer": "تحديد الأفعال المجرمة قانوناً وعقوبتها"
  },
  {
    "text": "يستند المعيار الشكلي في التمييز بين القواعد الآمرة والمكملة إلى............",
    "options": [
      "ألفاظ القاعدة القانونية",
      "موضوع النص القانوني",
      "معاني القواعد القانونية"
    ],
    "answer": "ألفاظ القاعدة القانونية"
  },
  {
    "text": "يجب أن تركز المعلومات المقدمة من الطبيب لمريضه على .............",
    "options": [
      "المرض",
      "العلاج والخيارات العلاجية المتاحة",
      "كل ما سبق"
    ],
    "answer": "كل ما سبق"
  },
  {
    "text": "يكون الطبيب مسؤولاً قانونياً في كل ما يأتي ........................................ عدا",
    "options": [
      "سحب جنيناً من رحم أمه رغم كبر رأسه وضيق عنق الرحم بصورة واضحة لا تسمح بمروره مما أدى إلى فصل الرأس عن الجسد وحصول نزيف لها أدى إلى وفاتها.",
      "إذا أجرى لمريضه عملية جراحية كبرى دون أن يتأكد من سلامة قلبه وقدرته على تحمل التخدير الكلي، مما أدى إلى وفاته.",
      "إذا قرر زيادة جرعة الدواء المقررة لمريضه عن الجرعة المعتادة، رغبة في أن يكون للدواء تأثيراً أقوى على مريضه، طالما أن هذه الزيادة لم تتجاوز الحد المعقول في ضوء الأصول العلمية المستقرة في علم الطب."
    ],
    "answer": "إذا قرر زيادة جرعة الدواء المقررة لمريضه عن الجرعة المعتادة، رغبة في أن يكون للدواء تأثيراً أقوى على مريضه، طالما أن هذه الزيادة لم تتجاوز الحد المعقول في ضوء الأصول العلمية المستقرة في علم الطب."
  },
  {
    "text": "التزام الطبيب بعلاج المريض ..................",
    "options": [
      "التزام بحقيق غاية",
      "التزام ببذل عناية",
      "إعطاء شيء"
    ],
    "answer": "التزام ببذل عناية"
  },
  {
    "text": "يشترط في المعلومات المقدمة من الطبيب لمريضه، ليتسنى له الحصول على رضاء حر ومستنير من جانب مريضه ................... أن تكون",
    "options": [
      "بسيطة وواضحة",
      "صادقة",
      "كل ما سبق"
    ],
    "answer": "كل ما سبق"
  },
  {
    "text": "..................... من مظاهر تقصير الطبيب في أداء عمله",
    "options": [
      "أن يتغيب الطبيب المكلف من قبل رب العمل بالتواجد في ميدان العمل.",
      "متابعة مريضه الذي بدأ معالجته ولم يزل خاضعاً تحت العلاج والجراحة.",
      "ضمان سلامة المريض من الأدوات أو الأجهزة التي يستعملها."
    ],
    "answer": "أن يتغيب الطبيب المكلف من قبل رب العمل بالتواجد في ميدان العمل."
  },
  {
    "text": "........ يعد التزام المحامي",
    "options": [
      "التزام بحقيق غاية",
      "التزام بقيام عمل",
      "التزام بامتناع عن عمل"
    ],
    "answer": "التزام بقيام عمل"
  },
  {
    "text": "يقع ........................... جزاء عند امتناع أحد أطراف العقد عن تنفيذ التزاماته.",
    "options": [
      "فسخ العقد",
      "البطلان النسبي للعقد",
      "البطلان المطلق"
    ],
    "answer": "فسخ العقد"
  },
  {
    "text": "وصف العمومية والتجريد في القواعد القانونية يعنى...........",
    "options": [
      "انطباقها على الناس كافة",
      "توجيهها لشخص معين باسمه",
      "توجيهها لواقعة معينة بالذات"
    ],
    "answer": "انطباقها على الناس كافة"
  },
  {
    "text": "تهد ............... إلى تنظيم الروابط التي تكون الدولة طرفاً فيها باعتبارها صاحبة سيادة",
    "options": [
      "القواعد المكملة",
      "قواعد القانون الخاص",
      "القانون العام"
    ],
    "answer": "القانون العام"
  },
  {
    "text": "...... يقصد به إظهار مباطن الأمور بكل صراحة ووضوح، للكشف عنها بالمداراة أو صورية.",
    "options": [
      "التزام بالصدق",
      "التزام بالأمانة",
      "التزام بالشفافية"
    ],
    "answer": "التزام بالشفافية"
  },
  {
    "text": "سن الرشد هي أحد وعشرون سنة ميلادية كاملة، تعد ..............",
    "options": [
      "قراراً إدارياً",
      "قاعدة قانونية آمرة",
      "قاعدة قانونية مكملة"
    ],
    "answer": "قاعدة قانونية آمرة"
  },
  {
    "text": "تعتبر فكرة .................. النظام العام فكرة",
    "options": [
      "مرنة",
      "جامدة",
      "التتغير بتغير الزمان والمكان"
    ],
    "answer": "مرنة"
  },
  {
    "text": "............. يجب أن يتحلى المهني بكل ما يأتي عدا",
    "options": [
      "عدم الغش",
      "المصارحة",
      "إفشاء أسرار عميله"
    ],
    "answer": "إفشاء أسرار عميله"
  },
  {
    "text": "لا يجوز للمحامي الاتفاق مع موكله على إعفائه من المسؤولية العقدية الناتجة عن عدم تنفيذ التزاماته في العقد إذا كان الخطأ",
    "options": [
      "جسيم",
      "عمدي",
      "كل ما سبق"
    ],
    "answer": "كل ما سبق"
  },
  {
    "text": "...................... تعد عقوبة التنبيه من صور الجزاء",
    "options": [
      "الجنائي",
      "الإداري",
      "السياسي"
    ],
    "answer": "الإداري"
  },
  {
    "text": ".طبقاً للمذهب ............. ينظر إلى الدولة بأنها دولة حارسة",
    "options": [
      "الفردي",
      "الاشتراكي",
      "الشيء مما سبق"
    ],
    "answer": "الفردي"
  },
  {
    "text": "يتماثل الالتزام التعاقدي بالإعلام مع ............. الالتزام بالإعلام قبل التعاقد من حيث",
    "options": [
      "المصدر",
      "الغاية",
      "وقت النشأة"
    ],
    "answer": "المصدر"
  },
  {
    "text": ".يكون الاثبات في المسائل ................... بكافة الطرق أياً كانت قيمة المعاملة",
    "options": [
      "المدنية",
      "التجارية",
      "كلاهما"
    ],
    "answer": "التجارية"
  },
  {
    "text": "........ يأخذ التشريع المصري الحالي بنظام",
    "options": [
      "المركزية الإدارية",
      "اللامركزية الإدارية",
      "الدمج بين النظامين"
    ],
    "answer": "المركزية الإدارية"
  },
  {
    "text": "............... هو جزاء تقضى به المحكمة من تلقاء نفسها دون أن يتوقع على طلب الخصوم",
    "options": [
      "البطلان المطلق",
      "البطلان النسبي",
      "التعويض"
    ],
    "answer": "البطلان المطلق"
  },
  {
    "text": "... العدل الاجتماعي يقتضي المساواة ......... بين أفراد المجتمع",
    "options": [
      "المطلقة",
      "النسبية",
      "كلاهما"
    ],
    "answer": "النسبية"
  },
  {
    "text": "................... تعد القاعدة القانونية قاعدة",
    "options": [
      "تقويمية",
      "تقريرية",
      "الشيء مما سبق"
    ],
    "answer": "الشيء مما سبق"
  },
  {
    "text": ".............. هو ذلك العدل الذي يقرر لمصلحة الفرد في مواجهة المجتمع",
    "options": [
      "العدل التبادلي",
      "العدل الاجتماعي",
      "العدل التوزيعي"
    ],
    "answer": "العدل التوزيعي"
  },
  {
    "text": ".مبلغ من المال يحكم به على المدين عن كل وحدة زمنية معينة يتقاعس فيها المدين عن تنفيذ التزامه تهديداً له لتنفيذ التزامه",
    "options": [
      "التعويض",
      "الغرامة",
      "الغرامة التهديدية"
    ],
    "answer": "الغرامة التهديدية"
  },
  {
    "text": ".يقتصر تطبيق .......... على العاملين بالجهاز الإداري للدولة",
    "options": [
      "الجزاء الإداري",
      "الجزاء الجنائي",
      "الجزاء المدني"
    ],
    "answer": "الجزاء الإداري"
  },
  {
    "text": "................. هو المعني بتنظيم مالية الدولة وتحديد مواردها وسبل تحصيلها وأوجه إنفاقها",
    "options": [
      "القانون الإداري",
      "القانون المالي",
      "القانون الدستوري"
    ],
    "answer": "القانون المالي"
  },
  {
    "text": ".................. التضامن بين المدينين في المعاملات",
    "options": [
      "المدنية",
      "التجارية",
      "جميع ما سبق"
    ],
    "answer": "التجارية"
  },
  {
    "text": "................. المسؤولية الناشئة عن الالتزام بالإعلام قبل التعاقد",
    "options": [
      "مسؤولية عقدية",
      "مسؤولية تقصيرية",
      ""
    ],
    "answer": "مسؤولية تقصيرية"
  },
  {
    "text": ".................... هي الدساتير التي يمكن تعديلها بسهولة عن طريق التشريع العادي",
    "options": [
      "الدساتير الجامدة",
      "الدساتير المرنة",
      ""
    ],
    "answer": "الدساتير المرنة"
  },
  {
    "text": "........ هي الجرائم المعاقب عليها بالغرامة التي لا يزيد حدها الأقصى عن 100 جنيه",
    "options": [
      "الجنايات",
      "الجنح",
      "المخالفات"
    ],
    "answer": "المخالفات"
  },
  {
    "text": "يعد ............. الجزاء المترتب على مخالفة قواعد القانون",
    "options": [
      "جزاء مادي",
      "جزاء معنوي",
      "الشيء مما سبق"
    ],
    "answer": "الشيء مما سبق"
  },
  {
    "text": ".... يخالف الطبيب الأصول العلمية الثابتة في علم الطب في كل ما يأتي عدا",
    "options": [
      "أقدم على إجراء إحدى العمليات الجراحية الدقيقة التي تفوق مؤهلاته العلمية",
      "إذا أجرى جراحة خطيرة تتزايد بدرجة كبيرة نسبة عدم نجاحها ما لم يتضح وجود ضرورة حتمية لإجرائها",
      "إذا أحال المريض طبيباً متخصصاً إذا كانت العملية الجراحية الدقيقة تفوق مؤهلاته العلمية وإمكانياته المادية"
    ],
    "answer": "إذا أحال المريض طبيباً متخصصاً إذا كانت العملية الجراحية الدقيقة تفوق مؤهلاته العلمية وإمكانياته المادية"
  },
  {
    "text": "يسمح للطبيب بالتدخل العلاجي دون الحصول على موافقة المريض",
    "options": [
      "حالة التطعيم ضد الأمراض المعدية",
      "حالة التطعيم ضد الأمراض المعدية",
      "حالة التطعيم ضد الأمراض المعدية"
    ],
    "answer": "حالة التطعيم ضد الأمراض المعدية"
  },
  {
    "text": "يجوز الجمع بين المحاماة والعمل",
    "options": [
      "رئيس مجلس إدارة شركة مساهمة",
      "كأستاذ قانون في الجامعات المصرية",
      "كأستاذ قانون في الجامعات المصرية"
    ],
    "answer": "كأستاذ قانون في الجامعات المصرية"
  },
  {
    "text": ".................... تقوم المسؤولية المدنية والجنائية في كل الحالات الآتية عدا",
    "options": [
      "إذا اتفق الطبيب مع زوج مريضته ليخبره بعجزها عن الإنجاب رغم أنها صالحة للإنجاب.",
      "إذا تفاقم موظف في شركة مع مدقق محاسب استعانت به الشركة لإثبات وجود فساد في حسابات الشركة في تواطؤ لإلحاق الضرار بصاحب الشركة لإخفاء الفساد المحاسبي الموجود في دفاتر الشركة.",
      "إذا حافظ المهني على أسرار عميله ولم يفشها لغير"
    ],
    "answer": "إذا حافظ المهني على أسرار عميله ولم يفشها لغير"
  },
  {
    "text": ".............. هو/هي مجموعة من القواعد العامة المجردة والتي تنظم سلوك الأفراد في المجتمع على سبيل الإلزام",
    "options": [
      "القانون",
      "العرف",
      "قواعد الأخلاق"
    ],
    "answer": "القانون"
  },
  {
    "text": "................ هو الجزاء الذي يقع على نفس الجاني أو جسمها وماله",
    "options": [
      "الجزاء المدني",
      "الجزاء الجنائي",
      "الجزاء الإداري"
    ],
    "answer": "الجزاء الجنائي"
  },
  {
    "text": "............. يعني الثبات الذي يحفظ للمجتمع بنيانه ويجنيه عوامل الهدم والفوضى",
    "options": [
      "الأمن",
      "الاستقرار",
      "العدل"
    ],
    "answer": "الاستقرار"
  },
  {
    "text": "............... يعد نظام التقادم من الأنظمة القانونية التي تهدف إلى تحقيق",
    "options": [
      "الأمن",
      "الاستقرار",
      "العدل"
    ],
    "answer": "الاستقرار"
  },
  {
    "text": "............... يعد من الأهداف الجوهرية للقاعدة القانونية تحقيق",
    "options": [
      "العدالة",
      "الأمن",
      "كلاهما"
    ],
    "answer": "كلاهما"
  },
  {
    "text": "................. هو ذلك العدل الذي يقرر لمصلحة الفرد في مواجهة المجتمع",
    "options": [
      "العدل التبادلي",
      "العدل الاجتماعي",
      "العدل التوزيعي"
    ],
    "answer": "العدل التوزيعي"
  },
  {
    "text": "العدل الاجتماعي يقتضي المساواة .............. بين أفراد المجتمع",
    "options": [
      "المطلقة",
      "النسبية",
      "كلاهما"
    ],
    "answer": "النسبية"
  },
  {
    "text": ".................. تعد القاعدة القانونية قاعدة",
    "options": [
      "تقويمية",
      "تقريرية",
      "الشيء مما سبق"
    ],
    "answer": "الشيء مما سبق"
  },
  {
    "text": "............. يعد الجزاء المترتب على مخالفة قواعد الأخلاق جزاء",
    "options": [
      "مادي",
      "معنوي",
      "كلاهما"
    ],
    "answer": "معنوي"
  },
  {
    "text": "................. هو البطلان الذي تقضي به المحكمة من تلقاء نفسها دون أن يتوقف على طلب الخصوم",
    "options": [
      "البطلان النسبي",
      "البطلان المطلق",
      "البطلان شبه المطلق"
    ],
    "answer": "البطلان المطلق"
  },
  {
    "text": ".................. يعد التنفيذ العيني أحد صور الجزاء",
    "options": [
      "المدني",
      "الجنائي",
      "الإداري"
    ],
    "answer": "المدني"
  },
  {
    "text": "............ هو جزاء لعيب في التنفيذ",
    "options": [
      "الفسخ",
      "البطلان",
      "كلاهما"
    ],
    "answer": "الفسخ"
  },
  {
    "text": "............ يجيز القانون المدني المصري الفوائد بحد أقصى",
    "options": [
      "4%",
      "5%",
      "7%"
    ],
    "answer": "5%"
  },
  {
    "text": "............. تعد عقوبة اللوم من صور الجزاء",
    "options": [
      "الجنائي",
      "السياسي",
      "الإداري"
    ],
    "answer": "الإداري"
  },
  {
    "text": "الأحكام ............ هي الأحكام التي تنظم العلاقة بين الإنسان وغيره من بني جنسه",
    "options": [
      "الأخلاقية",
      "العقائدية",
      "أحكام المعاملات"
    ],
    "answer": "أحكام المعاملات"
  },
  {
    "text": "قواعد .......... تعني بتنظيم كلا من السلوك الداخلي والخارجي للإنسان",
    "options": [
      "القانون",
      "الدين",
      "كلاهما"
    ],
    "answer": "كلاهما"
  },
  {
    "text": "تختلف قواعد الدين عن قواعد القانونية من حيث",
    "options": [
      "المدى",
      "الدين",
      "كلاهما"
    ],
    "answer": "كلاهما"
  },
  {
    "text": "......... أي مما يلي يهدف فقط إلى تنظيم علاقة الإنسان بغيره",
    "options": [
      "قواعد الدين",
      "قواعد الأخلاق",
      "القواعد القانونية"
    ],
    "answer": "القواعد القانونية"
  },
  {
    "text": "........... الجزاء المترتب على مخالفة قواعد المجاملات جزاء",
    "options": [
      "مادي",
      "معنوي",
      "كلاهما"
    ],
    "answer": "معنوي"
  },
  {
    "text": "طبقاً للمذهب ............. ينظر إلى الدولة بأنها دولة حارسة",
    "options": [
      "الفردي",
      "الاشتراكي",
      "الشيء مما سبق"
    ],
    "answer": "الفردي"
  },
  {
    "text": "يتميز المذهب ............ بالحد من طغيان الدولة واستبدادها",
    "options": [
      "الفردي",
      "الاشتراكي",
      "كلاهما"
    ],
    "answer": "الفردي"
  },
  {
    "text": "يؤدي اعتناق المذهب ........... إلى انتشار التضخم في المجتمع وسيطرة رؤوس الأموال",
    "options": [
      "الفردي",
      "الاشتراكي",
      "كلاهما"
    ],
    "answer": "الفردي"
  },
  {
    "text": "............. طبقاً للمذهب الاشتراكي ينظر إلى الملكية الفردية نظرة",
    "options": [
      "فردية",
      "اجتماعية",
      "جماعية"
    ],
    "answer": "اجتماعية"
  },
  {
    "text": "................ دعي أنصار المذهب الاشتراكي إلى الأخذ بفكرة",
    "options": [
      "العدل التبادلي",
      "العدل التطبيقي",
      "العدل التوزيعي"
    ],
    "answer": "العدل التوزيعي"
  },
  {
    "text": ".............. طبقاً للرأي الراجح، بفضل اعتناق الدولة للمذهب",
    "options": [
      "الفردي",
      "الاشتراكي",
      "التوسط بين المذهبين"
    ],
    "answer": "التوسط بين المذهبين"
  },
  {
    "text": "طبقاً للرأي الراجح في الفقه، يأخذ بمعيار ................ للتفرقة بين القانون العام والقانون الخاص",
    "options": [
      "أطراف العلاقة",
      "صفة الأطراف",
      "المصلحة"
    ],
    "answer": "المصلحة"
  },
  {
    "text": "القانون ............. هو مجموعة من القواعد التي تنظم العلاقات القانونية التي تكون الدولة أحد أطرافها بوصفها صاحبة سيادة",
    "options": [
      "العام",
      "المختلط",
      "العادي"
    ],
    "answer": "العام"
  },
  {
    "text": "يختص القضاء ............. بالفصل في المنازعات المدنية والتجارية التي تنشأ بين أشخاص القانون الخاص",
    "options": [
      "الإداري",
      "المختلط",
      "العادي"
    ],
    "answer": "العادي"
  },
  {
    "text": "يختص ................... بتحديد القواعد التي تحكم العلاقات الدولية بين الدول والمنظمات الدولية",
    "options": [
      "القانون الدولي العام",
      "القانون الدولي الخاص",
      "القانون التجاري"
    ],
    "answer": "القانون الدولي العام"
  },
  {
    "text": "........................ يأخذ التشريع المصري الحالي بنظام",
    "options": [
      "المركزية الإدارية",
      "اللامركزية الإدارية",
      "الدمج بين النظامين"
    ],
    "answer": "المركزية الإدارية"
  },
  {
    "text": "............................ هو القانون المعني بتحديد أموال الدولة العامة منها والخاصة",
    "options": [
      "القانون الدستوري",
      "القانون المالي",
      "القانون الإداري"
    ],
    "answer": "القانون المالي"
  },
  {
    "text": "............... أحد فروع القانون الخاص",
    "options": [
      "الدستوري",
      "المالي",
      "التجاري"
    ],
    "answer": "التجاري"
  },
  {
    "text": "يعد القانون ................... القواعد الموضوعية التي تنظم العلاقة القانونية",
    "options": [
      "القانون المدني",
      "قانون العمل",
      "قانون المرافعات"
    ],
    "answer": "القانون المدني"
  },
  {
    "text": "يكون الاثبات في المسائل ................... بكافة الطرق أياً كانت قيمة المعاملة",
    "options": [
      "المدنية",
      "التجارية",
      "الجنائية"
    ],
    "answer": "التجارية"
  },
  {
    "text": "يعد قانون المرافعات المدنية والتجارية قانون",
    "options": [
      "إجرائي",
      "موضوعي",
      "يتضمن قواعد إجرائية وتشكيلية"
    ],
    "answer": "يتضمن قواعد إجرائية وتشكيلية"
  },
  {
    "text": "تتسم القوانين الآتية بأن جميع قواعدها آمرة",
    "options": [
      "القانون المالي",
      "القانون الإداري",
      "القانون المدني"
    ],
    "answer": "القانون الإداري"
  },
  {
    "text": "يستمد الالتزام بالإعلام قبل التعاقد مص",
    "options": [
      "العقد",
      "المبادئ العامة للقانون",
      "العرف"
    ],
    "answer": "المبادئ العامة للقانون"
  },
  {
    "text": "يتماثل الالتزام التعاقدي بالإعلام مع الالتزام بالإعلام قبل التعاقد من حيث",
    "options": [
      "الغاية",
      "المصدر",
      "وقت النشأة"
    ],
    "answer": "المصدر"
  }
]
            }
        ];

        // ==========================================
        // 5. قاعدة بيانات بنك الأسئلة (Test Bank)
        // ==========================================
        var testBanks = [
            { 
                title: "Test Bank 2020 - Computer & Ethics",pdf:"qestions/tast_bank/Test_Bank_2020_Computer_Ethics.pdf" ,
                interactive: true,
                questions: [{"text": "ما علاقة العادات والتقاليد بالمواعظ الأخلاقية؟", "options": ["أ- كل العادات والتقاليد مواعظ أخلاقية", "ب- كل العادات والتقاليد مواعظ غير أخلاقية", "ج- بعض العادات والتقاليد مواعظ أخلاقية"], "answer": "ج- بعض العادات والتقاليد مواعظ أخلاقية"},
                    {"text": "هل عادة الأخذ بالثأر جائزة أم لا؟", "options": ["أ- عادة الأخذ بالثأر عادة جائزة قانوناً", "ب- عادة الأخذ بالثأر عادة جائزة شرعاً", "ج- عادة الأخذ بالثأر عادة غير جائزة شرعاً وقانوناً"], "answer": "ج- عادة الأخذ بالثأر عادة غير جائزة شرعاً وقانوناً"},
                    {"text": "هل يمكن أن تتحول مواعظ العادات والتقاليد إلى قواعد قانونية؟", "options": ["أ- لا تتحول بعض مواعظ العادات والتقاليد مطلقاً إلى قواعد قانونية", "ب- تتحول مواعظ العادات والتقاليد دائماً إلى قواعد قانونية", "ج- تتحول بعض مواعظ العادات والتقاليد إلى قواعد قانونية"], "answer": "ج- تتحول بعض مواعظ العادات والتقاليد إلى قواعد قانونية"},
                    {"text": "هل العدل والعدالة لفظان مترادفان؟", "options": ["أ- العدالة والعدل وجهان لعملة واحدة", "ب- العدالة أعم وأوسع من العدل", "ج- العدل أعم وأوسع من العدالة"], "answer": "أ- العدالة والعدل وجهان لعملة واحدة"},
                    {"text": "على أي نوع من أنواع المساواة يُعول عند توزيع الثروة بين أبناء المجتمع؟", "options": ["أ- المساواة المطلقة", "ب- المساواة النسبية فيما بينهم", "ج- المساواة التقريبية"], "answer": "ب- المساواة النسبية فيما بينهم"},
                    {"text": "يتم التوزيع فيما بينهم حسب ما تراه الإدارة العامة في الدولة مناسباً وفق تقديرها المطلق.", "options": ["أ- يجب أن يعول عند توزيع الثروات بين أبناء المجتمع على المساواة المطلقة فيما بينهم", "ب- يتم التوزيع فيما بينهم حسب ما تراه الإدارة العامة في الدولة مناسباً وفق تقديرها المطلق", "ج- يتم التوزيع فيما بينهم حسب ما تراه الإدارة العامة في الدولة مناسباً وفق تقديرها النسبي"], "answer": "ب- يتم التوزيع فيما بينهم حسب ما تراه الإدارة العامة في الدولة مناسباً وفق تقديرها المطلق"},
                    {"text": "عند وضع أحكام للرجال والنساء يجب مراعاة المساواة التامة أو المساواة المطلقة بينهما.", "options": ["أ- عند وضع أحكام للرجال والنساء يجب مراعاة المساواة التامة أو المساواة المطلقة بينهما", "ب- عند وضع أحكام للرجال والنساء يجب مراعاة المساواة النسبية أو التقريبية بينهما", "ج- التمييز الدائم بينهما لمصلحة من ترى الإدارة العامة تمييزه على الآخر"], "answer": "ب- عند وضع أحكام للرجال والنساء يجب مراعاة المساواة النسبية أو التقريبية بينهما"},
                    {"text": "ما هي الطبيعة القانونية لقواعد القانون العام من حيث قوتها؟", "options": ["أ- كل قواعد القانون العام قواعد آمرة أو ملزمة", "ب- كل قواعد القانون العام قواعد مكملة أو مقررة", "ج- غالبية قواعد القانون العام قواعد آمرة وبعضها قواعد مكملة"], "answer": "ج- غالبية قواعد القانون العام قواعد آمرة وبعضها قواعد مكملة"},
                    {"text": "ما هي الطبيعة القانونية لقواعد القانون الخاص من حيث قوتها؟", "options": ["أ- كل قواعد القانون الخاص قواعد مكملة أو مقررة", "ب- كل قواعد القانون الخاص قواعد آمرة", "ج- غالبية قواعد القانون الخاص قواعد مكملة وبعضها قواعد آمرة"], "answer": "ج- غالبية قواعد القانون الخاص قواعد مكملة وبعضها قواعد آمرة"},
                    {"text": "ما هي علاقة القانون بالأخلاق؟", "options": ["أ- كل القواعد القانونية قواعد أخلاقية", "ب- كل القواعد القانونية قواعد غير أخلاقية", "ج- بعض القواعد القانونية قواعد أخلاقية"], "answer": "ج- بعض القواعد القانونية قواعد أخلاقية"},
                    {"text": "في أي جريدة يجب نشر القانون لنفاذه؟", "options": ["أ- يجب لنفاذ القانون نشره في أي جريدة معتمدة داخل الدولة", "ب- يجب لنفاذ القانون نشره في عدة جرائد معتمدة داخل الدولة", "ج- يجب لنفاذ القانون نشره في الجريدة الرسمية"], "answer": "ج- يجب لنفاذ القانون نشره في الجريدة الرسمية"},
                    {"text": "ما هو العدد اللازم لصحة انعقاد مجلس النواب؟", "options": ["أ- يجب حضور كل أعضاء مجلس النواب لصحة انعقاد المجلس", "ب- يجب حضور نصف أعضاء المجلس على الأقل لصحة انعقاد المجلس", "ج- يجب حضور نصف أعضاء المجلس زائد واحد لصحة انعقاد المجلس"], "answer": "ج- يجب حضور نصف أعضاء المجلس زائد واحد لصحة انعقاد المجلس"},
                    {"text": "ماذا تعني الأغلبية المطلقة للأعضاء؟", "options": ["أ- القانون المدني هو أقدم وأعرق فروع القانون على الإطلاق", "ب- القانون الجنائي هو أقدم وأعرق فروع القانون على الإطلاق", "ج- القانون التجاري هو أقدم وأعرق فروع القانون على الإطلاق"], "answer": "أ- القانون المدني هو أقدم وأعرق فروع القانون على الإطلاق"},
                    {"text": "هل يملك القاضي خيار تطبيق القانون أو عدم تطبيقه في ضوء تقديره لعدالته أو عدم عدالته؟", "options": ["أ- للقاضي مأمور بتطبيق القانون إذا رآه عادلاً", "ب- للقاضي مأمور بتطبيق القانون ولو رآه غير عادل", "ج- للقاضي يختار الحل العادل من القانون أو من غيره"], "answer": "ب- للقاضي مأمور بتطبيق القانون ولو رآه غير عادل"},
                    {"text": "هل يجوز للقاضي عند الفصل في القضايا الاحتكام إلى ضميره الشخصي؟", "options": ["أ- يجوز للقاضي عند الفصل في القضايا الاحتكام إلى ضميره الشخصي", "ب- لا يجوز للقاضي الاحتكام إلى ضميره الشخصي وعليه أن يحتكم إلى القانون وحده", "ج- يجوز للقاضي الاحتكام إلى ضميره الشخصي في بعض الحالات"], "answer": "ب- لا يجوز للقاضي الاحتكام إلى ضميره الشخصي وعليه أن يحتكم إلى القانون وحده"},
                    {"text": "هل الإنسان قادر على توفير كل احتياجاته اليومية دون الاستعانة بغيره؟", "options": ["أ- إن عيش الإنسان وحده في المجتمع يعد فرضاً منطقياً", "ب- إن عيش الإنسان وحده في المجتمع يعد فرضاً جدلياً لا يمكن تصوره", "ج- الإنسان قادر على توفير كل احتياجاته دون الاستعانة بغيره"], "answer": "ب- إن عيش الإنسان وحده في المجتمع يعد فرضاً جدلياً لا يمكن تصوره"},
                    {"text": "السلطة القضائية هي السلطة المختصة بتطبيق القانون.", "options": ["أ- السلطة القضائية هي السلطة المختصة بتطبيق القانون", "ب- السلطة القضائية هي السلطة المختصة بتنفيذ القوانين", "ج- السلطة القضائية هي السلطة المختصة بوضع القوانين"], "answer": "أ- السلطة القضائية هي السلطة المختصة بتطبيق القانون"},
                    {"text": "ما هو دور التشريعية في المجتمع؟", "options": ["أ- السلطة التشريعية هي السلطة المختصة بسن التشريعات ومراقبة عمل وأداء الحكومة", "ب- السلطة التشريعية هي السلطة المختصة بتنفيذ القوانين في المجتمع", "ج- السلطة التشريعية هي السلطة المختصة بتطبيق القوانين في المجتمع"], "answer": "أ- السلطة التشريعية هي السلطة المختصة بسن التشريعات ومراقبة عمل وأداء الحكومة"},
                    {"text": "ما هي السلطة العامة التي يترأسها رئيس الدولة في مصر؟", "options": ["أ- رئيس الدولة هو الرئيس الأعلى للسلطة التنفيذية", "ب- رئيس الدولة هو الرئيس الأعلى للسلطة القضائية", "ج- رئيس الدولة هو الرئيس الأعلى للسلطة التشريعية"], "answer": "أ- رئيس الدولة هو الرئيس الأعلى للسلطة التنفيذية"},
                    {"text": "هل القانون غاية أم وسيلة؟", "options": ["أ- القانون غاية وليس وسيلة", "ب- القانون غاية ووسيلة في آن واحد", "ج- القانون وسيلة وليس غاية"], "answer": "ج- القانون وسيلة وليس غاية"},
                    {"text": "ما هي طبيعة الجزاء في قواعد الأخلاق؟", "options": ["أ- الجزاء في الأخلاق جزاء معنوي فقط", "ب- الجزاء في الأخلاق جزاء مادي ومعنوي", "ج- الجزاء في الأخلاق جزاء مادي فقط"], "answer": "أ- الجزاء في الأخلاق جزاء معنوي فقط"},
                    {"text": "هل يتصور إفلات أحد من العقاب عند مخالفته للقاعدة القانونية؟", "options": ["أ- لا يفلت أحد أبداً من العقاب عند مخالفة القاعدة القانونية", "ب- يتصور أن يفلت المخالف للقاعدة القانونية من العقاب المقترن بها إذا لم يتوفر الدليل القانوني الصحيح على مخالفته", "ج- يتصور أن يفلت المخالف للقاعدة القانونية من العقاب المقترن بها رغم توفر الصحيح المثبت لهذه المخالفة"], "answer": "ب- يتصور أن يفلت المخالف للقاعدة القانونية من العقاب المقترن بها إذا لم يتوفر الدليل القانوني الصحيح على مخالفته"},
                    {"text": "هل القاعدة الأخلاقية قاعدة ملزمة للمخاطبين بها أم لا؟", "options": ["أ- الجزاء المعنوي في القاعدة الأخلاقية هو جزاء ذاتي داخلي فقط متمثل في وخزات أو تأنيب الضمير", "ب- الجزاء المعنوي في القاعدة الأخلاقية هو جزاء ظاهر خارجي فقط يوقعه المجتمع على المخالف في شكل ازدرائه ومقاطعته على هذه المخالفة متمثل في وخزات أو تأنيب الضمير", "ج- الجزاء المعنوي في القاعدة الأخلاقية هو جزاء مزدوج ظاهري وخارجي يوقعه المجتمع على المخالف في شكل ازدرائه ومقاطعته على هذه المخالفة، وجزاء ذاتي داخلي يوقعه الفرد على نفسه إن كان من أصحاب الضمائر الحية"], "answer": "ج- الجزاء المعنوي في القاعدة الأخلاقية هو جزاء مزدوج ظاهري وخارجي يوقعه المجتمع على المخالف في شكل ازدرائه ومقاطعته على هذه المخالفة، وجزاء ذاتي داخلي يوقعه الفرد على نفسه إن كان من أصحاب الضمائر الحية"},
                    {"text": "هل يعتمد القانون في مخاطبته للأشخاص عند صياغة قواعده على أسلوب الترغيب أو الترهيب أو عليهما معاً؟", "options": ["أ- يعتمد القانون في صياغته لقواعده على أسلوب الترهيب فقط في مخاطبة الأفراد", "ب- يعتمد القانون في صياغته لقواعده على أسلوب الترغيب فقط في مخاطبة الأفراد", "ج- يعتمد القانون في صياغته لقواعده على أسلوب الترغيب والترهيب معاً في مخاطبة الأفراد"], "answer": "ج- يعتمد القانون في صياغته لقواعده على أسلوب الترغيب والترهيب معاً في مخاطبة الأفراد"},
                    {"text": "هل يعتمد الدين في مخاطبته للأشخاص عند صياغة قواعده على أسلوب الترغيب أو الترهيب أو عليهما معاً؟", "options": ["أ- لا يفلت أحد أبداً من العقاب الدنيوي عند مخالفة القاعدة الدينية", "ب- لا يفلت أحد أبداً من العقاب الدنيوي عند مخالفة القاعدة الدينية", "ج- قد يفلت المخالف للقاعدة الدينية من العقاب الدنيوي أو الأخروي إذا لم يتوفر الدليل ضده المثبت لهذه المخالفة"], "answer": "ج- قد يفلت المخالف للقاعدة الدينية من العقاب الدنيوي أو الأخروي إذا لم يتوفر الدليل ضده المثبت لهذه المخالفة"},
                    {"text": "هل يمكن تصور عيش الإنسان منفرداً في الحياة؟", "options": ["أ- يعيش الإنسان وحده في المجتمع فرضاً ولا يمكن تصوره", "ب- يعيش الإنسان وحده في المجتمع فرضاً ويمكن تصوره", "ج- لا يمكن للإنسان العيش بمعزل عن بني جنسه"], "answer": "أ- يعيش الإنسان وحده في المجتمع فرضاً ولا يمكن تصوره"},
                    {"text": "ما هي المهمة القانونية لوجود القانون في المجتمع؟", "options": ["أ- وجود القانون ضرورة اجتماعية لضبط سلوك الحكام في المجتمع", "ب- وجود القانون ضرورة اجتماعية لضبط سلوك المحكومين في المجتمع", "ج- وجود القانون ضرورة اجتماعية لضبط السلوك الإنساني في المجتمع حكاماً ومحكومين معاً"], "answer": "ج- وجود القانون ضرورة اجتماعية لضبط السلوك الإنساني في المجتمع حكاماً ومحكومين معاً"},
                    {"text": "ما هو عدد السلطات العامة في مصر وفقاً للدستور؟", "options": ["أ- السلطات العامة في مصر هي أربع سلطات", "ب- السلطات العامة في مصر هي ثلاث سلطات", "ج- السلطات العامة في مصر هي خمس سلطات"], "answer": "ب- السلطات العامة في مصر هي ثلاث سلطات"},
                    {"text": "ما هي السلطات العامة في مصر وفقاً للدستور؟", "options": ["أ- السلطات العامة في مصر هي السلطة التشريعية والسلطة القضائية والسلطة التنفيذية والصحافة", "ب- السلطات العامة في مصر هي رئيس الجمهورية والمحكمة الدستورية العليا والحكومة", "ج- السلطات العامة في مصر هي السلطة التشريعية والسلطة التنفيذية والسلطة القضائية"], "answer": "ج- السلطات العامة في مصر هي السلطة التشريعية والسلطة التنفيذية والسلطة القضائية"},
                    {"text": "ما هي الطبيعة القانونية لمبدأ الفصل بين السلطات؟", "options": ["أ- مبدأ الفصل بين السلطات مبدأ اجتماعي", "ب- مبدأ الفصل بين السلطات مبدأ دستوري", "ج- مبدأ الفصل بين السلطات مبدأ قانوني"], "answer": "ب- مبدأ الفصل بين السلطات مبدأ دستوري"},
                    {"text": "السلطة القضائية هي السلطة المختصة بوضع القانون.", "options": ["أ- السلطة القضائية هي السلطة المختصة بوضع القانون", "ب- السلطة القضائية هي السلطة المختصة بتطبيق القانون", "ج- السلطة القضائية هي السلطة المختصة بتنفيذ القوانين"], "answer": "ب- السلطة القضائية هي السلطة المختصة بتطبيق القانون"},
                    {"text": "السلطة التشريعية هي السلطة المختصة بسن التشريعات ومراقبة عمل وأداء الحكومة.", "options": ["أ- السلطة التشريعية هي السلطة المختصة بسن التشريعات ومراقبة عمل وأداء الحكومة", "ب- السلطة التشريعية هي السلطة المختصة بتنفيذ القوانين في المجتمع", "ج- السلطة التشريعية هي السلطة المختصة بتطبيق القوانين في المجتمع"], "answer": "أ- السلطة التشريعية هي السلطة المختصة بسن التشريعات ومراقبة عمل وأداء الحكومة"},
                    {"text": "السلطة التنفيذية هي السلطة المختصة بوضع التشريع الفرعي في مصر.", "options": ["أ- السلطة التنفيذية هي السلطة المختصة بوضع التشريع الفرعي في ظل الدستور المصري الحالي", "ب- السلطة التنفيذية هي السلطة المختصة بتطبيق القوانين", "ج- السلطة التنفيذية هي السلطة المختصة بتنفيذ القوانين"], "answer": "أ- السلطة التنفيذية هي السلطة المختصة بوضع التشريع الفرعي في ظل الدستور المصري الحالي"},
                    {"text": "كيف يتحقق الإلزام في القاعدة القانونية؟", "options": ["أ- يتحقق الإلزام في القاعدة القانونية عند شعور الأفراد بضروريتها", "ب- يتحقق الإلزام في القاعدة القانونية عند اقترانها بالجزاء الذي يلوح به في وجه من يخالفها", "ج- يتحقق الإلزام في القاعدة القانونية عند تطبيق القضاء لها"], "answer": "ب- يتحقق الإلزام في القاعدة القانونية عند اقترانها بالجزاء الذي يلوح به في وجه من يخالفها"},
                    {"text": "ما هي أنواع السلوك الإنساني التي تنظمها قواعد الأخلاق؟", "options": ["أ- تنظم قواعد الأخلاق سلوك الإنسان فقط مع غيره من بني جنسه سواء كان ظاهرياً أو باطنياً", "ب- تنظم قواعد الأخلاق سلوك الإنسان فقط مع نفسه", "ج- تنظم قواعد الأخلاق كل سلوك الإنساني سواء مع ربه وخالقه أو مع نفسه أو مع غيره"], "answer": "ج- تنظم قواعد الأخلاق كل سلوك الإنساني سواء مع ربه وخالقه أو مع نفسه أو مع غيره"},
                    {"text": "هل قواعد الأخلاق قواعد مكتوبة أم غير مكتوبة؟", "options": ["أ- قواعد الأخلاق قواعد مكتوبة", "ب- قواعد الأخلاق قواعد غير مكتوبة", "ج- بعض قواعد الأخلاق مكتوبة وبعضها غير مكتوبة"], "answer": "ب- قواعد الأخلاق قواعد غير مكتوبة"},
                    {"text": "هل القاعدة القانونية قاعدة عامة ومجردة أم قاعدة خاصة ومعينة؟", "options": ["أ- القاعدة القانونية قاعدة خاصة", "ب- القاعدة القانونية قاعدة عامة غير مجردة", "ج- القاعدة القانونية قاعدة عامة ومجردة"], "answer": "ج- القاعدة القانونية قاعدة عامة ومجردة"},
                    {"text": "هل القاعدة القانونية قاعدة أخلاقية؟", "options": ["أ- كل القواعد القانونية قواعد أخلاقية", "ب- بعض القواعد القانونية قواعد أخلاقية", "ج- كل القواعد القانونية قواعد غير أخلاقية"], "answer": "ب- بعض القواعد القانونية قواعد أخلاقية"},
                    {"text": "ما نوع السلوك الإنساني الذي تنظمه القاعدة القانونية؟", "options": ["أ- القاعدة القانونية منظمة لسلوك الإنسان مع ربه", "ب- القاعدة القانونية منظمة لسلوك الإنسان مع نفسه", "ج- القاعدة القانونية منظمة لسلوك الإنسان مع غيره من بني جنسه"], "answer": "ج- القاعدة القانونية منظمة لسلوك الإنسان مع غيره من بني جنسه"},
                    {"text": "علم القانون هو أحد العلوم الطبيعية.", "options": ["أ- علم القانون هو أحد العلوم الطبيعية", "ب- علم القانون هو أحد العلوم الاجتماعية", "ج- علم القانون هو علم ما وراء الطبيعة"], "answer": "ب- علم القانون هو أحد العلوم الاجتماعية"},
                    {"text": "ما هي أنواع الجزاء في القانون؟", "options": ["أ- الجزاء في القانون جزاء واحد وهو الجزاء الجنائي", "ب- الجزاء في القانون له صورتان فقط وهو الجزاء الجنائي والجزاء المدني", "ج- الجزاء في القانون له أشكال متعددة قد يكون جنائياً أو مدنياً أو إدارياً أو سياسياً، وقد تجتمع هذه الصور مع بعضها البعض معظمها أو قليل منها حسب الظروف"], "answer": "ج- الجزاء في القانون له أشكال متعددة قد يكون جنائياً أو مدنياً أو إدارياً أو سياسياً، وقد تجتمع هذه الصور مع بعضها البعض معظمها أو قليل منها حسب الظروف"},
                    {"text": "أي القاعدتين أكثر دقة ووضوحاً القاعدة القانونية أم القاعدة الأخلاقية؟", "options": ["أ- القاعدة القانونية بوصفها قاعدة مكتوبة أكثر دقة ووضوحاً من القاعدة الأخلاقية", "ب- القاعدة الأخلاقية رغم كونها قاعدة غير مكتوبة إلا أن رسوخها في الوجدان فهي أكثر دقة من القاعدة القانونية", "ج- القاعدة الأخلاقية تتسم بالدقة والوضوح مثلها مثل القاعدة القانونية"], "answer": "أ- القاعدة القانونية بوصفها قاعدة مكتوبة أكثر دقة ووضوحاً من القاعدة الأخلاقية"},
                    {"text": "هل القاعدة القانونية قاعدة ملزمة أم لا؟", "options": ["أ- القاعدة القانونية قاعدة ملزمة", "ب- القاعدة القانونية قاعدة غير ملزمة", "ج- القاعدة القانونية قاعدة مكملة"], "answer": "أ- القاعدة القانونية قاعدة ملزمة"},
                    {"text": "هل قواعد الأخلاق قواعد ملزمة أم غير ملزمة؟", "options": ["أ- قواعد الأخلاق قواعد ملزمة", "ب- قواعد الأخلاق قواعد غير ملزمة", "ج- بعض قواعد الأخلاق ملزمة وبعضها غير ملزمة"], "answer": "ب- قواعد الأخلاق قواعد غير ملزمة"},
                    {"text": "هل يمكن تصور أن يفلت أحد من العقاب عند مخالفة القاعدة الدينية؟", "options": ["أ- لا يمكن تصور أن يفلت أحد من العقاب عند مخالفة القاعدة الدينية", "ب- يمكن أن يفلت المخالف للقاعدة الدينية من العقاب الدنيوي فقط", "ج- قد يفلت المخالف للقاعدة الدينية من العقاب الدنيوي أو الأخروي إذا لم يتوفر الدليل ضده المثبت لهذه المخالفة"], "answer": "ج- قد يفلت المخالف للقاعدة الدينية من العقاب الدنيوي أو الأخروي إذا لم يتوفر الدليل ضده المثبت لهذه المخالفة"},
                    {"text": "هل يمكن تصور ممارسة رئيس الدولة سلطة وضع التشريع العادي في مصر؟", "options": ["أ- لرئيس الدولة ممارسة سلطة وضع التشريع العادي في أي وقت إذا اقتضت المصلحة العامة للدولة", "ب- لا يملك رئيس الدولة مطلقاً أي حق في ممارسة سلطة وضع هذا التشريع لأنه من اختصاص مجلس النواب وحده", "ج- لرئيس الدولة ممارسة سلطة وضع التشريع العادي في حالة الضرورة فقط، معتمداً بشروطها"], "answer": "ج- لرئيس الدولة ممارسة سلطة وضع التشريع العادي في حالة الضرورة فقط، معتمداً بشروطها"},
                    {"text": "من هو صاحب الاختصاص الأصيل في سن التشريع العادي في مصر؟", "options": ["أ- رئيس الجمهورية", "ب- مجلس الوزراء", "ج- مجلس النواب"], "answer": "ج- مجلس النواب"},
                    {"text": "تنظم القاعدة القانونية السلوك الإنساني الباطن فقط مع الغير.", "options": ["أ- تنظم القاعدة القانونية السلوك الإنساني الظاهري فقط مع الغير", "ب- تنظم القاعدة القانونية السلوك الإنساني الباطن فقط مع الغير", "ج- تنظم القاعدة القانونية السلوك الإنساني الظاهري والباطن معاً مع الغير"], "answer": "أ- تنظم القاعدة القانونية السلوك الإنساني الظاهري فقط مع الغير"},
                    {"text": "ما هي طبيعة علم القانون؟", "options": ["أ- علم القانون هو أحد العلوم الطبيعية", "ب- علم القانون هو أحد العلوم الاجتماعية", "ج- علم القانون هو علم ما وراء الطبيعة"], "answer": "ب- علم القانون هو أحد العلوم الاجتماعية"},
                    {"text": "الجزاء في القانون له أشكال متعددة قد يكون جنائياً أو مدنياً أو إدارياً أو سياسياً، ولا تجتمع هذه الصور مع بعضها البعض.", "options": ["أ- الجزاء في القانون له أشكال متعددة قد يكون جنائياً أو مدنياً أو إدارياً أو سياسياً، ولا تجتمع هذه الصور مع بعضها البعض", "ب- الجزاء في القانون له أشكال متعددة قد يكون جنائياً أو مدنياً أو إدارياً أو سياسياً، وتجتمع هذه الصور مع بعضها البعض في بعض الأحيان", "ج- الجزاء في القانون له أشكال متعددة قد يكون جنائياً أو مدنياً أو إدارياً أو سياسياً، وقد تجتمع هذه الصور مع بعضها البعض معظمها أو قليل منها حسب الظروف"], "answer": "ج- الجزاء في القانون له أشكال متعددة قد يكون جنائياً أو مدنياً أو إدارياً أو سياسياً، وقد تجتمع هذه الصور مع بعضها البعض معظمها أو قليل منها حسب الظروف"},
                    {"text": "القاعدة القانونية بوصفها قاعدة مكتوبة أكثر دقة ووضوحاً من القاعدة الأخلاقية.", "options": ["أ- القاعدة القانونية بوصفها قاعدة مكتوبة أكثر دقة ووضوحاً من القاعدة الأخلاقية", "ب- القاعدة الأخلاقية رغم كونها قاعدة غير مكتوبة إلا أن رسوخها في الوجدان فهي أكثر دقة من القاعدة القانونية", "ج- القاعدة الأخلاقية تتسم بالدقة والوضوح مثلها مثل القاعدة القانونية"], "answer": "أ- القاعدة القانونية بوصفها قاعدة مكتوبة أكثر دقة ووضوحاً من القاعدة الأخلاقية"},
                    {"text": "القاعدة القانونية قاعدة ملزمة.", "options": ["أ- القاعدة القانونية قاعدة ملزمة", "ب- القاعدة القانونية قاعدة غير ملزمة", "ج- القاعدة القانونية قاعدة مكملة"], "answer": "أ- القاعدة القانونية قاعدة ملزمة"},
                    {"text": "قواعد الأخلاق قواعد غير مكتوبة.", "options": ["أ- قواعد الأخلاق قواعد مكتوبة", "ب- قواعد الأخلاق قواعد غير مكتوبة", "ج- بعض قواعد الأخلاق مكتوب وبعضها غير مكتوب"], "answer": "ب- قواعد الأخلاق قواعد غير مكتوبة"},
                    {"text": "هل قواعد العادات والتقاليد قواعد ملزمة للأفراد في المجتمع أم لا؟", "options": ["أ- قواعد العادات والتقاليد قواعد غير ملزمة للأفراد في المجتمع", "ب- قواعد العادات والتقاليد قواعد ملزمة للأفراد في المجتمع", "ج- بعض قواعد العادات والتقاليد قواعد ملزمة للأفراد في المجتمع وبعضها الآخر غير ملزم لهم"], "answer": "ج- بعض قواعد العادات والتقاليد قواعد ملزمة للأفراد في المجتمع وبعضها الآخر غير ملزم لهم"},
                    {"text": "من هي السلطة العامة المختصة بوضع التشريع الفرعي أو ما يسمى باللوائح في مصر؟", "options": ["أ- السلطة التشريعية - ممثلة في مجلس النواب - هي السلطة المختصة بوضع التشريع الفرعي أو ما يسمى باللوائح في مصر", "ب- السلطة التنفيذية هي وحدها السلطة المختصة بوضع التشريع الفرعي أو ما يسمى باللوائح في مصر", "ج- السلطة القضائية هي وحدها السلطة المختصة بوضع التشريع الفرعي أو ما يسمى باللوائح في مصر"], "answer": "ب- السلطة التنفيذية هي وحدها السلطة المختصة بوضع التشريع الفرعي أو ما يسمى باللوائح في مصر"},
                    {"text": "كيف يتحقق الإلزام في القاعدة القانونية؟", "options": ["أ- يتحقق الإلزام في القاعدة القانونية عند شعور الأفراد بضروريتها", "ب- يتحقق الإلزام في القاعدة القانونية عند اقترانها بالجزاء الذي يلوح به في وجه من يخالفها", "ج- يتحقق الإلزام في القاعدة القانونية عند تطبيق القضاء لها"], "answer": "ب- يتحقق الإلزام في القاعدة القانونية عند اقترانها بالجزاء الذي يلوح به في وجه من يخالفها"},
                    {"text": "ما هي أنواع السلوك الإنساني التي تنظمها قواعد الأخلاق؟", "options": ["أ- تنظم قواعد الأخلاق سلوك الإنسان فقط مع غيره من بني جنسه سواء كان ظاهرياً أو باطنياً", "ب- تنظم قواعد الأخلاق سلوك الإنسان فقط مع نفسه", "ج- تنظم قواعد الأخلاق كل سلوك الإنساني سواء مع ربه وخالقه أو مع نفسه أو مع غيره"], "answer": "ج- تنظم قواعد الأخلاق كل سلوك الإنساني سواء مع ربه وخالقه أو مع نفسه أو مع غيره"},
                    {"text": "هل قواعد الأخلاق قواعد مكتوبة أم غير مكتوبة؟", "options": ["أ- قواعد الأخلاق قواعد مكتوبة", "ب- قواعد الأخلاق قواعد غير مكتوبة", "ج- بعض قواعد الأخلاق مكتوبة وبعضها غير مكتوبة"], "answer": "ب- قواعد الأخلاق قواعد غير مكتوبة"}
                ]
            }
        ];



